{"1": {"created": "2017-04-22 21:11:54", "title": "Comprehensive Ethereum Reading List", "num_comments": 6, "upvote_ratio": 0.87, "score": 14, "num_crossposts": 0, "comments": [["2017-05-26 05:01:48", "kudos to you and all contributors...this is very well done.", 2], ["2017-06-27 09:13:19", "Wonderful. Thanks!", 2], ["2017-05-30 16:11:50", "Thats great, thanks very much", 1], ["2017-06-25 19:45:59", "I like the way you broke up the list, looks like I've got my reading list lined up.", 1], ["2017-06-29 16:16:58", "Very helpful. Thanks.", 1], ["2017-05-28 04:39:33", "Thanks! I appreciate the kind words.", 1]]}, "2": {"created": "2017-08-31 21:03:59", "title": "Blowjob Token Contract - Get a blowjob.", "num_comments": 20, "upvote_ratio": 0.84, "score": 9, "num_crossposts": 0, "comments": [["2017-09-01 05:07:52", "The first 10 or so people who provide a wallet address here will get 0.9 blowjob. I will check that the wallet is active (etherscan.io) and isn't brand new.    \n    \nThis is mostly to see how well the silly thing works. The BJs will happen this evening at the earliest - I'm away from the computer having a functional mist wallet. Do tell if there's an easier way.", 2], ["2017-09-17 11:48:53", "[deleted]", 2], ["2017-09-02 04:59:17", "[deleted]", 1], ["2017-09-02 18:12:44", "0x6a8076e1b8fC43D5e07d03Ba090d7a19e1cdafd1", 1], ["2017-09-02 23:52:26", "[deleted]", 1], ["2017-12-02 16:12:35", "0x384d6a80C87D2f185faf095a137888E5E6156e80", 1], ["2018-02-24 12:40:04", "You should give a bunch of them too\n0x627306090abaB3A6e1400e9345bC60c78a8BEf57", 1], ["2017-09-01 07:39:22", "Is this open source?  \n\nEDIT: btw I only have a brand new address, as I keep the few eth I have in exchanges:  \n\n0x31dc767b1975b077dc457d2a291c17c16692b0b7\n\n", 1], ["2017-09-01 13:19:00", "I will gladly take some BJ. Thanks!\n\n0x677EF1D1CF1737F9152630A93533b31dB4D80641", 1], ["2017-09-01 13:31:37", "Please send some\n0xEe3d81fEaB9E3316073143D8bC079C7E4F8C51f3", 1], ["2017-09-19 23:31:39", "It happened. In your sleep.", 2], ["2017-09-02 06:31:51", "You now have 0.9 blowjob!", 1], ["2017-09-03 03:21:08", "You just got 0.9 blowjob!    \n\nAll BJ purchase eth is currently redirected to Hurricane Harvey relief (pun intended). You can get that last 0.1 BJ for about 35 cents in ether. Do you want the happy ending?\n", 1], ["2017-09-03 03:19:18", "Ringside, you just got 0.9 blowjob!\n\nI used myetherwallet to send - had to use the address instead of ringside.eth. Weird.\n\nAll BJ purchase  eth is currently redirected to Hurricane Harvey relief (pun intended). You can get that last 0.1 BJ for about 35 cents in ether. Do you want the happy ending?", 1], ["2017-12-06 05:15:56", "Done - the eth blockchain is a bit slow, but not as slow as me. Three days is an awfully long time to anticipate a BJ.", 1], ["2018-02-27 07:37:09", "Will do once I get home. ", 1], ["2017-09-01 12:01:55", "You have received not 0.9, but *2 BJs*. One to treasure, one to share.    \n    \nYou can check out the code on etherscan.io:\nhttps://etherscan.io/address/0x0e68e030c68604840017194d90b535eabe1ea059#code    \nYes the code is open source. If you're into this sort of coding, start with the fine contributions of the Zeppelin team at:\nhttps://github.com/OpenZeppelin/zeppelin-solidity    \nTheir work is excellent and its always best to stand on the shoulders of giants.\n", 2], ["2017-09-01 14:17:04", "transferred", 2], ["2017-09-01 14:16:54", "transferred", 2], ["2017-09-05 08:52:05", "[deleted]", 1], ["2017-12-12 01:29:06", "and - it finally transferred. Who'd have expected that cat game to DDOS the blockchain.", 1], ["2017-09-01 19:20:51", "Wow thank you very much!", 1], ["2017-09-06 00:25:35", "Just send the 0.001 eth to the contract address. You automatically get the .1 BJ and, until I change it, the Habitat for Humanity in TX (Hurricane Harvey relief) will get the 0.001 eth.", 1], ["2017-09-08 01:19:56", "I saw the transaction for the 0.1 BJ go through so I added 10 more. I also clarified the web page a bit. The contract itself deposited your .001 eth in the Habitat for Humanity wallet.", 1]]}, "3": {"created": "2017-07-26 17:14:09", "title": "Conscious Capitalism Coin - The Worlds First Charitable Crypto-Currency.", "num_comments": 0, "upvote_ratio": 0.72, "score": 9, "num_crossposts": 0, "comments": []}, "4": {"created": "2015-08-12 23:15:19", "title": "500 ETH to win, government \"simulation\"", "num_comments": 9, "upvote_ratio": 0.77, "score": 10, "num_crossposts": 0, "comments": [["2015-08-16 00:54:25", "So i was the last (only) loser :P 100 ETH to the creator of the game (i assume it was).\n\nGood game, it was fair and fun.", 5], ["2015-08-13 23:43:22", "Can you explain. I send 6 ETH what happens when the person after me sends in 6 ETH?", 1], ["2015-08-14 02:34:40", "It is getting interesting :) everyone who was in so far made the +10%.", 1], ["2015-08-14 13:38:42", "What happens if someone pay 500ETH and there is not enough debt  to pay off, where will the 90% of 500 go?", 1], ["2015-08-15 07:55:24", "if you are using the contract I recommend this to monitor it: https://www.reddit.com/r/ethereum/comments/3gz5ug/a_reminder_that_there_is_a_bot_on_the_android_app/cu3dle8?context=3", 1], ["2015-08-16 02:35:14", "sorry, my honest plan was to keep it alive for much longer. I just missed to invest further. I lost this way another 100ETH that are locked in a contract that can only invest in the Ponzi. But I learned a lot and I will for sure start a new one. Any suggestions for better rules? Maybe it should be possible for everyone to somehow take the ownership.", 2], ["2015-08-14 01:03:25", "if you send 6ETH you register a claim of 6.6ETH. If no one for about 12h after you sends new money in you win the full contract balance (about 500ETH). If more people send money in this money will be used to pay out the claims. So eventually (if enough ether comes in) the contact will send you 6.6ETH back and than delete your claim.", 1], ["2015-08-14 13:43:13", "well, there is always more debt than money (because the 500 would create 550 of new debt). The 490ETH will be used to pay old debt first. If there is less than 490ETH debt so far the remainder will be used for the new 550 debt.", 1], ["2015-08-16 03:14:41", "Hard to say what can be changed, nothing comes to mind but this concept is for sure fun. Still a ponzi but as sure it's only used for fun with small values it's a good learning vehicle.", 1]]}, "5": {"created": "2017-07-21 21:27:49", "title": "All 3 Projects Hacked Had Infinity Symbol In Their Logo", "num_comments": 1, "upvote_ratio": 0.91, "score": 9, "num_crossposts": 0, "comments": [["2017-08-18 07:15:17", "Illuminati", 1]]}, "6": {"created": "2018-03-22 18:18:25", "title": "Check out the DApp I've made to allow for accepting campaign contributions through Ethereum", "num_comments": 3, "upvote_ratio": 1.0, "score": 7, "num_crossposts": 0, "comments": [["2018-03-23 12:34:13", "Nice. How does the KYC work?", 2], ["2018-03-23 13:16:06", "The kyc is currently contact info entered by the person that is verified by the campaign. It can be done customizably for any campaign and could theoretically be automated in the future.", 3], ["2018-03-23 13:24:53", "Yeah feel free to go on Ropsten and test it out if you’d like. The verifyKYC function is called with the necessary parameters and they’re checked to not be null and then stored.\n\nAs there is currently no on-chain way of verifying KYC info, it is up to the contract owner (most likely campaign manager or the actual person campaigning) to verify KYC information before accepting a contribution.\n\nKYC info can be reset by the owner if no contribution has been accepted yet, but after accepting a contribution from an account the KYC data can never be changed. The goal here is to provide a solid yet simple KYC system with only a single point of failure, that being the owner of the contract.  Due to the transparency provided by the blockchain however, this point of failure isn’t as large of an issue as any breaches of trust can be seen immediately and by everyone.\n\nIf you’re a developer and would like to add further KYC info that you require, the struct KYCObject will be what you want to modify.  Changing the related events and functions (verifyKYC, resetKYC, etc) would be necessary as well but if you’re adding further KYC info you may wish to completely recode those related functions to better fit your purposes.", 2]]}, "7": {"created": "2018-03-18 15:55:43", "title": "EthernalGo: Play Go on ethereum VS other people and win Ether", "num_comments": 9, "upvote_ratio": 0.68, "score": 5, "num_crossposts": 1, "comments": [["2018-03-19 07:21:18", "I've thought about making an on-chain chess/go game, but decided against it because I could not think of a good & easy way to prevent people from using computer assistance. There's an obvious incentive to do so when there's money at stake.", 3], ["2018-03-19 17:02:07", "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/dapps] [EthernalGo: Play Go on ethereum VS other people and win Ether](https://www.reddit.com/r/dapps/comments/85i2j7/ethernalgo_play_go_on_ethereum_vs_other_people/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", 1], ["2018-03-20 00:44:38", "Cool, I didn’t realize funfair was using those, I’ll have a look and maybe in the next iteration or the upcoming game we will switch to state channels.", 1], ["2018-03-27 16:38:13", "great project.\nYou can submit it to https://dappinsight.com to get early traffic \n:)", 1], ["2018-03-19 14:44:54", "Great point, we got some feedback on that in other forums.\n\nI figured there would be an early phase where people are actually playing the game and eventually some bots would appear. \nIf one would play today , so early after the release I doubt they will encounter a bot.\n\nIf  the game will transition to bots playing against each other, I think it could be pretty cool actually, because of its decentralized nature, anyone can develop anything on top it.", 0], ["2018-03-27 17:02:17", "Thanks, submitted! \nNice website, I wasn't familiar with it. Did you make it?", 1], ["2018-03-20 00:18:23", "Why make it onchain instead of state channels? Sounds like a waste of gas.", 2], ["2018-03-20 00:27:37", "Good question, we started looking into state channels but felt it wasn’t ready for production use just yet.\nAre you familiar with production apps running in state channels?", 1], ["2018-03-20 00:28:37", "Only ones i know of that are production ready is funfair. Plenty of proof of concepts online though.", 2]]}, "8": {"created": "2018-03-06 15:22:30", "title": "ETHERBOTS Launches, overtaking CryptoKitties in Transaction Volume (Again)", "num_comments": 0, "upvote_ratio": 1.0, "score": 8, "num_crossposts": 0, "comments": []}, "9": {"created": "2018-02-04 13:00:20", "title": "DappRadar.com - Dapps Listing - Ranking - Stats", "num_comments": 1, "upvote_ratio": 1.0, "score": 8, "num_crossposts": 0, "comments": [["2018-02-15 13:12:09", "Hey DappRadar guys...how's it going?  We have been trying to add BillionTix to your list.  Do you only display the top volume Dapps or are you comprehensive?  Just wondering how to get in your good graces!  Love the info your site provides...been seeing you pop up in more articles on Medium and other places lately.  Keep up the good work!", 2]]}, "10": {"created": "2017-12-19 16:48:42", "title": "Are you interested in cryptocurrencies and ICOs and want to learn more?", "num_comments": 0, "upvote_ratio": 0.74, "score": 8, "num_crossposts": 0, "comments": []}, "11": {"created": "2017-09-06 06:15:53", "title": "Ethereum Smart Contracts in C# - Introducing EthSharp", "num_comments": 0, "upvote_ratio": 0.88, "score": 6, "num_crossposts": 0, "comments": []}, "12": {"created": "2016-04-19 13:12:22", "title": "Etheramid - multi-level invitation game", "num_comments": 9, "upvote_ratio": 0.88, "score": 6, "num_crossposts": 0, "comments": [["2016-04-21 14:56:13", "The visualization on the website (http://etheramid.cloudapp.net/) is really cool!  \n\nI don't get how to join with invite though. There is no JSON code to use in order to watch a contract in Mist? ", 2], ["2016-07-31 23:05:12", "I am trying to send to join and it's failing. \n\nDo I need to add data? \n\nHow much gas? Can I go with the slow option?\n\nWhen I add the transaction I get a red warning \"Execution failed. Consumed all provided gas.\"", 2], ["2016-04-22 13:10:59", "Can people enter from a wallet contract address, or could this cause problems? Should people enter from their main account address in Mist to be safe? ", 1], ["2016-06-10 01:20:32", "Some statistics:\n\n- Right now there are about 100 users.\n\n- About 40% most active users have received reward more 1 Ether.\n\n- About 10% of users have received reward more than 2 Ether.\n\nFor invitation you can build invitation links and share it.", 1], ["2016-04-21 17:17:02", "Two ways to join.\n1) Find you inviter in the graph and execute Join to commant in geth console.\n2) Add contract to Ethereum wallet:\n - Address is 0x9758DA9B4D001Ed2d0DF46d25069Edf53750767a\n - Json code is [{ \"constant\": true, \"inputs\": [{ \"name\": \"id\", \"type\": \"uint256\" }], \"name\": \"getParticipantById\", \"outputs\": [{ \"name\": \"inviter\", \"type\": \"address\" }, { \"name\": \"itself\", \"type\": \"address\" }, { \"name\": \"totalPayout\", \"type\": \"uint256\" }], \"type\": \"function\" }, { \"constant\": true, \"inputs\": [], \"name\": \"getParticipantCount\", \"outputs\": [{ \"name\": \"count\", \"type\": \"uint256\" }], \"type\": \"function\" }, { \"constant\": false, \"inputs\": [{ \"name\": \"inviter\", \"type\": \"address\" }], \"name\": \"enter\", \"outputs\": [], \"type\": \"function\" }, { \"constant\": true, \"inputs\": [{ \"name\": \"adr\", \"type\": \"address\" }], \"name\": \"getParticipantByAddress\", \"outputs\": [{ \"name\": \"inviter\", \"type\": \"address\" }, { \"name\": \"itself\", \"type\": \"address\" }, { \"name\": \"totalPayout\", \"type\": \"uint256\" }], \"type\": \"function\" }, { \"inputs\": [], \"type\": \"constructor\" }] \n\nAll this you can find in FAQ section or external sites like etherscan, etherchain or ethercamp. The contract is verified by them.\n\nThank you for your interest in the project.", 1], ["2016-08-16 18:41:13", "Yes, you need to add Data, You can find value on website graph popup. Try to increase Gas to 1000000. It should be enough.", 1], ["2016-05-12 03:24:40", "Yes, but you need to be careful and check conditions from UPD2", 1], ["2016-04-22 13:09:12", "Wow I justed checked and I already received some ETH from your contract! \n\nI joined without invite and without using the contract, just by sending 1 ETH to the contract address. \n\nI had searched the FAQ for the JSON code and did not find it. I checked again now and finally found it under \"What is contract ABI?\". \n\nNow I did not know what ABI is, so I didn't check that point before. Maybe rename it to include \"JSON\" so noobs know where to look lol. \n\nIf I want to invite somebody with my address, what would be the best way to do that. I mean I can not just tweet a link ...  \n\nI could make a page or blog post explaining how to add the contract in Mist and how to select \"Enter\" and how to enter my address into the field \"Inviter address\"  - But what incentive would somebody have to enter my address as the inviter as opposed to leaving it out?", 1], ["2016-04-22 17:28:20", "Thank you! Yes, you are right ABI is Json code to watch contract.\nI'n going to implement some mechanism for invitation link.", 1]]}, "13": {"created": "2016-03-04 01:25:14", "title": "dns2", "num_comments": 0, "upvote_ratio": 0.88, "score": 6, "num_crossposts": 0, "comments": []}, "14": {"created": "2018-03-02 05:35:19", "title": "Anybody know of any dApps fully deployed in a language other than English?", "num_comments": 1, "upvote_ratio": 0.86, "score": 5, "num_crossposts": 0, "comments": [["2018-03-06 20:06:40", "My site called CoinStacks.co at https://coinstacks.co is deployed in English, but we are planning to work on translation soon. Chinese will be available soon.", 1]]}, "15": {"created": "2018-02-12 16:47:25", "title": "Are you really dapps-developer? Let's talk about blockchain Oracles :)", "num_comments": 15, "upvote_ratio": 0.89, "score": 7, "num_crossposts": 0, "comments": [["2018-02-13 10:35:54", "My dapps don’t use any oracles, and I don’t think they need any.", 2], ["2018-02-22 12:04:59", "How do you keep Oracles transparent?  How can you completely trust a contract that uses them?", 2], ["2018-02-24 13:15:43", "Decentralized solution for an oracle? Thats a hard question, the potential and incentive to abuse them are high.\n\nYou could look at traditional consensus algorithms, or voting schemes, or multi signature transactions where many trusted people need to sign. Or a voting system which delegates who is trusted. But still, a motivated and well funded user could pretty much get past any of those.", 2], ["2018-03-09 17:15:43", "Hi, I've been analysing a project where we needed an oracle for an exchange price feed. The main features we needed (beyond basic oracle functionality) where, in no particular order:\n\n* Redundancy and guaranteed uptime for the server collecting and publishing data. Failure to deliver data can be just as bad as delivering wrong data.\n\n* Ability to pay for each data point **on-chain**. This could be via depositing a bounty in a smart contract and have the oracle collect it, or it could be by having the oracle publish encrypted data which can be decrypted for a fee.\n\n* Data signature which can be verified **on-chain**. The most important quality of smart contracts is the minimization of trust. It is paramount that the data posted by the oracle can be verified as genuine from the single trusted party, and not manipulated by the \"blockchain mailman\". Oraclize supports server signatures from APIs, but they cannot be verified (easily at least) on-chain and the signature should be from the data provider, not just their server API.\n\nOf cause there are all sorts of service, interface, scaling and gas-cost considerations to think about, but without the above any oracle solution would have been a non-starter for us.\n\nHope to see your product succeed! :)", 1], ["2018-02-15 13:05:27", "There are some things that smart contracts can't do without help from the outside.  One of them right off the top of my head is that of getting current exchange rates of ethereum.  Say you wanted to make  a dapp that needs to pay users $20USD?? Probably going to need an oracle to tell it how much ether to send.\n\nSure there are a lot more examples, this just immediately popped into my head. ", 2], ["2018-02-13 17:46:05", "Hey! Is it means that work of your dapps encapsulated into blockchain or you provide data to the smart-contracts by yourself? ", 1], ["2018-02-22 22:23:15", "Hello! Once the Oracle is created and paid, we send a verification transaction that indicates the type and time of delivery of the data. Our service provides an independent supply of data, we are not interested in falsifying information. Now we are working on a decentralized solution.", 1], ["2018-02-26 19:18:31", "Hello! \nYes, you’re right - the decentralized solution is hard to create, but in our opinion it is real.\n\nYes, you’re right again, but why should we have some trusted third-party? This approach kills the idea of the absence of any trusted party. \n\nAnd immediately the next question arises: why do we use blockchain with this approach? Actually, it doesn't make much sense.\n\nAs in the case of cryptocurrencies, the main thing in creating the decentralized solution is to come up with a system in which the correct behavior strategy will be the most profitable for network participants.", 1], ["2018-02-15 13:06:34", "If Dai traded on Etherdelta, you could use Etherdelta as a price oracle.", 2], ["2018-02-21 22:44:54", "I agree with that. But I would add that there are problems that can't be addressed directly form contracts, although that they can run the procedure.\n\nFor example, you can generate random numbers in a smart contract. But if you are going to use RNG in a lottery, you should better use a different approach to make a fair product and increase security. Also happens with time sensitive applications like fast auctions. \n\nSo the problem is more the concept and security than the availability of the features. ", 1], ["2018-02-24 13:22:53", "IMO you should really avoid trying to keep things in USD, and avoid using an oracle. Thats just asking to be abused. If you must use an oracle, it better be damn well trusted, and you better be damn sure it's going to be trusted much longer than your smart contract will be.  \n\nIf your concerned about making it usd, I would make a 2 transaction exchange where the sender puts in 20$ worth, as they know it too be, and the receiver withdraws 20$ worth as they know it to be. The transaction wouldn't be complete until the withdraw. \n\nOr you could use something like MAD as described in the particl white paper. ", 1], ["2018-03-02 02:42:02", "A decentralized solution could be trusted by many people, then a motivated actor could manipulate it, even slightly/temporarily, to gain some kind of edge.\n\nThe front end for the contact could warn the user in the case that it goes awry, but it there are still no guaruntees.\n\nI've thought a lot about this because I almost decided to build a stable coin. My idea was too create an erc-20 token that would mint and transfer a token for x*1.01 and buy back and burn for x. Every time the token was bought the contract would gain a small amount of eth, hopefully enough to continue buying during a massive eth crash.\n\nWith each purchase and sale, users could vote for the new token price, each block the last blocks votes would be considered, and the votes falling outside the std deviation would be ignored. Also a maximum change per block would be enforced.\n\nThe front end would query coinbase, gemni, etc... And vote the average price of Y dollars for the token.\n\nHopefully the tyranny of the default would keep it stable, as an attacker would have to write their own interaction, and out spend everyone else, for a sustained period of time.\n\n\n\nMaybe my idea will give you some ideas to work with. I can't think of a way it could be generalized, each situation would need it's own approach. Good luck!", 2], ["2018-03-02 20:57:15", "Thank you for your feedback and interest!\nSo you think that a decentralized solution can not be created on current functionality and it should be a brand new system?", 1], ["2018-03-12 03:21:42", "Perhaps a new system? You would have to do research and hopefully write a solid white paper. I think it mostly depends on what your trying to oracle", 2], ["2018-03-12 22:53:41", "Yes, actually we think in terms of a new system. We clearly understand an amount of work. Thanks!", 1]]}, "16": {"created": "2018-01-02 18:30:14", "title": "19 years old student, spent my holiday to develop a free desktop client for CoinMarketCap", "num_comments": 4, "upvote_ratio": 0.75, "score": 6, "num_crossposts": 0, "comments": [["2018-01-04 00:59:18", "Proclaiming your age makes you sound ageist.", -1], ["2018-01-04 18:00:33", "Rather just wanted to inform the community that I'm with you. I live in London and you'd think that students here are more in touch with crypto, but they aren't.\n\nIn a way, I wanted to encourage fellow peers to get involved and show that is easy to contribute.", 3], ["2018-01-16 19:02:46", "lolwut", 2], ["2018-02-01 20:33:08", "just ignore the troll.", 2]]}, "17": {"created": "2017-10-16 17:06:01", "title": "[ICO ANN] 200 million users Aptoide launches ERC20 token for App Stores", "num_comments": 0, "upvote_ratio": 0.71, "score": 4, "num_crossposts": 0, "comments": []}, "18": {"created": "2017-03-21 23:25:08", "title": "Introducing Lunyr and the future of crowdsourced knowledge", "num_comments": 2, "upvote_ratio": 0.64, "score": 6, "num_crossposts": 0, "comments": [["2017-03-23 11:28:43", "Very cool! If this gets big, I believe more front-ends will be developed, especially ones that do not show ads. If these become the primary way of viewing the content, will there be enough incentive to keep contributing?", 1], ["2017-06-05 12:29:59", "Why wouldn't Wikimedia just introduce a coin-based system on top of Ethereum? In fact, I hope the EEA announcement this month includes Wikimedia. That would be awesome.", 1]]}, "19": {"created": "2016-08-04 08:56:53", "title": "Colony makes it easy for people all over the world to build companies together online", "num_comments": 0, "upvote_ratio": 0.86, "score": 5, "num_crossposts": 0, "comments": []}, "20": {"created": "2016-07-28 12:28:08", "title": "etherfaces.com - A FaceBook in Ethereum in a million Pixels!", "num_comments": 10, "upvote_ratio": 1.0, "score": 6, "num_crossposts": 0, "comments": [["2016-07-29 00:35:56", "Is this a working prototype? I can't seem to do much on here", 1], ["2016-07-29 04:06:44", "just gave it a shot...fun idea.  seems to be working but the UI could use a bit of a facelift.", 1], ["2016-07-29 00:39:00", "Yes, it is a working prototype.\n\nThis is the intended usage of the website-\n\n 1. You should select a grid on the left,\n 2. Add details on the right - a headline, your picture, and your contact website or email, and some brief description about yourself or your startup.\n 3. And then you can add the details to the Blockchain by submitting a transaction in Ethereum Wallet or from within the browser by uploading your wallet file.\n\nAlso, note that there is no wall or any methods to communicate with other users as of yet. It will be a directory of early adopters, ethereum enthusiasts, developers  all displayed in one single page.\n\nI also apologize the page is not intuitive. I'll try to add some help in the page :)", 1], ["2016-07-29 20:43:42", "@ETHNews, could you please try the page now and let me know. I added a few text help messages.", 1], ["2016-07-29 05:02:59", "@dapp-vc, I thank you for checking out our website. It is an honour to have you as one of our very first users!\n\nWe are working the UI, there are a lot of things to be improved there. I will update you once we have a new UI.\n\nI thank you once again for checking out and being the first users and also for your valuable feedback!", 2], ["2016-08-02 02:28:54", "site won't load", 1], ["2016-08-02 02:31:34", "Hey @ETHNews, I'm just making some updates to the site! Give me a few minutes for the updates to complete. I thank you for your attempt to visit the site and I apologize for the inconvenience caused.", 1], ["2016-08-09 06:31:17", "Not sure if you got a chance to try out our page, with our new updates to the page today, we've improved our UI and have made registrations free. Let me know if you have any questions using the page!", 1], ["2016-08-10 03:15:55", "it's still asking for wallet/password", 1], ["2016-08-10 03:22:16", "Yes, as the data is stored in blockchain, it uses a little gas. Try using MetaMask Chrome Plugin, that is one of the recommended/secure ways to use DApps from browser.", 1]]}, "21": {"created": "2016-04-02 14:58:35", "title": "BlockKing Game", "num_comments": 1, "upvote_ratio": 1.0, "score": 6, "num_crossposts": 0, "comments": [["2016-04-05 05:50:56", "Well done !", 1]]}, "22": {"created": "2018-05-01 16:57:58", "title": "Fund Giveth and WIN! Seedom’s 1st Mainnet Fundraiser Game LIVE", "num_comments": 0, "upvote_ratio": 0.67, "score": 4, "num_crossposts": 0, "comments": []}, "23": {"created": "2018-04-06 01:20:26", "title": "colors.gg is an Ethereum dApp that lets you pick, change, and leave a message with your color (go team Red!) in a blockchain-based chatroom, with a creative way of displaying new/old messages", "num_comments": 3, "upvote_ratio": 1.0, "score": 6, "num_crossposts": 0, "comments": [["2018-04-06 14:47:24", "I like the concept ", 2], ["2018-04-06 13:53:01", "Solving real world problems one dApp at a time. Blockchain technology is the future! ", 1]]}, "24": {"created": "2018-03-28 10:11:49", "title": "Dapp Insight : A list of the best decentralized Ethereum applications (DApps)", "num_comments": 1, "upvote_ratio": 0.84, "score": 4, "num_crossposts": 0, "comments": [["2018-04-16 09:30:50", "the mouse over shake is very satisfying lol", 1]]}, "25": {"created": "2018-03-27 08:14:15", "title": "EthPledge: Smart contract for matching charity donations", "num_comments": 1, "upvote_ratio": 0.86, "score": 5, "num_crossposts": 0, "comments": [["2018-03-27 21:40:41", "Looks very interesting and totally something I would use!  The only problem I can find is  that your structs are quite big. I’ve found having structs of around 256 bytes is where storage operations start costing a decent amount. Your structs seem to be around 512+ bytes and I can only imagine gas prices for createCampaign as well as others is quite high.\n\nReally neat concept though and with some improvement a lot of good could be done. Maybe store a hash of the description rather than the whole thing on the blockchain.  That way you could check the description is right with a single method and store it in one too, and it’s all would only take 32 bytes.   Shortening up some of your numbers (uint is equivalent to uint256) could also help save memory. Just remember to have your struct line up with 256 bits for faster and more efficient storage.", 2]]}, "26": {"created": "2018-03-15 18:21:25", "title": "Economeme: The Meme Economy Built On Ethereum.", "num_comments": 1, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": []}, "27": {"created": "2018-02-24 22:09:33", "title": "You can now sponsor you dapp website on https://www.stateofthedapps.com/ by paying with ETH", "num_comments": 1, "upvote_ratio": 1.0, "score": 6, "num_crossposts": 0, "comments": [["2018-03-10 09:29:36", "yeah I saw this, cool.", 1]]}, "28": {"created": "2018-02-16 20:32:18", "title": "Ether Voxel Space - 3D world on Ethereum", "num_comments": 4, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": [["2018-02-17 13:16:34", "[deleted]", 1], ["2018-02-18 02:58:07", "This is super cool, nice job dude. I could see something by where people could make puzzles in a micecraft/lego-esque way that other people pay a small amount to finish. If they can't finish, the puzzle continues to accumulate the amounts as people pay, and whoever does unlock gets the reward :)", 1], ["2018-02-17 15:28:34", "Thanks! Yes. Minecraft would be possible :)", 1], ["2018-02-18 05:06:06", "Thanks! Yes, I was thinking about expanding the idea into a game.", 1], ["2018-02-18 06:41:49", "Another idea.. take a sweet real lego build, hash its block properties (number of blocks, shapes, colors, etc), then see if people can recreate the exact hash from a few pictures. I remember back in the day lego's would come with pictures on the side of the boxes displaying the different things the pieces could do. It really made the imagination fly and it was always fun to try and recreate something from just the pictures. I notice the modern boxes don't really seem to have that.\n\nSo essentially, you could get .5 ETH  (for discussions sake, prices can be set like cryptokitties and such) for completing some cool build, but you could get hints from more pictures of the build, and each hint would have a cost, if you took all the hints, perhaps you just break even or lose whatever you initially paid to play the game (like .001 eth or whatever market dictates?). People could submit their own builds that get voted on through consensus and officially added to the game with their own price and block properties attached. Imagination really is the limit.", 1]]}, "29": {"created": "2018-02-12 12:30:16", "title": "New version EtherUI is deployed. Prompt creating UI for Smart contracts.", "num_comments": 0, "upvote_ratio": 1.0, "score": 6, "num_crossposts": 0, "comments": []}, "30": {"created": "2017-10-20 08:50:00", "title": "ICO Wizard", "num_comments": 2, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": [["2017-11-08 15:16:01", "I have been trying to understand ICO wizard code but its too hard to understand what part of the code is doing what. There is not a single comment of description on any method, names are just random, only author of the code can understand it, I guess :D", 1], ["2017-11-10 04:18:03", "please try to research here: https://github.com/oraclesorg\nOr if you have questions, submit them there as well. ", 1]]}, "31": {"created": "2017-10-17 21:21:06", "title": "The Pyramid Game - Building a pyramid from solid Ether - Profit when blocks are placed on top of yours", "num_comments": 13, "upvote_ratio": 0.75, "score": 4, "num_crossposts": 0, "comments": [["2017-10-18 08:44:36", "nice definitely want in on this scheme", 5], ["2017-11-20 06:15:04", "Anyone else think this is brilliant!?", 2], ["2017-12-12 19:16:18", "Cool concept. Cheap enough to buy in just for the excitement, kind of like a lottery! ", 2], ["2018-03-06 04:55:59", "I just bought two consecutive blocks next to each other, and then built one block in the middle on top of them. So was I supposed to get ether back into my MetaMask ? How do I receive my Ether, am I supposed to do something with the smart contract? ", 2], ["2017-10-26 06:38:18", "The game is glitching out today. It keeps reloading. (I am using chrome 62 on windows 10, with metamask installed)\n\n", 1], ["2018-02-09 07:22:14", "Is there a way to find your block if you haven't check in in awhile?", 1], ["2017-10-18 11:45:22", "Its a reverse funnel system", 4], ["2017-10-18 17:27:38", "Good luck :-)", 2], ["2017-12-12 19:50:34", "Thank you and good luck! :-)", 1], ["2018-03-06 06:02:56", "The Ether you receive from blocks above yours accumulates in your in-game balance. It does not go directly to your Metamask. The reason for this is to reduce transaction fees.\n\nYou can withdraw it to your Metamask with the \"Withdraw all\" button in the top-left panel.", 1], ["2017-10-26 08:39:08", "its working now. I had to switch networks, and accounts, and then back. Anyway, cool dapp! thanks!", 1], ["2017-10-26 14:07:16", "Thank you! I'm sorry about that, this issue was only present for about 2 minutes so you must have been one of the unlucky ones :-)", 1]]}, "32": {"created": "2017-10-05 04:36:50", "title": "Introducing Oracles Network - consensus by respectable individuals", "num_comments": 0, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": []}, "33": {"created": "2017-09-24 00:59:24", "title": "Dapp putting migrant worker contracts on blockchain", "num_comments": 7, "upvote_ratio": 0.86, "score": 5, "num_crossposts": 0, "comments": [["2017-10-12 08:04:52", "Very cool! I think this is a much needed application. Way too many people are exploited as migrant workers.", 3], ["2017-11-23 05:34:19", "Really late getting to see this, but this is fantastic and very much needed. I'm launching a new company in a few months that at its core will encourage people to create social impact dapps. This is something I will share as an example. Good stuff!", 2], ["2017-10-18 09:03:38", "thank you so much! it's definitely been interesting just learning about the space and the type of corruption that takes place in the industry. hopefully our solution can help end some of the corruption.", 2], ["2017-11-23 06:09:36", "Cool thanks for the comments! We have a version of the app launched on the Rinkeby testnet, let us know if you're interested in trying it out!", 2], ["2017-11-23 06:16:22", "Yes, I would love to check it out.", 1], ["2017-11-23 06:39:27", "https://handshake-dapp.herokuapp.com/ \n\nYou'll need to have Rinkeby running on Metamask in Chrome to get it up and running.", 2], ["2017-11-23 08:24:15", "Got it. I'll check it out when I get home. Thanks! ", 2]]}, "34": {"created": "2017-09-22 03:59:24", "title": "Huge Ethereum Mixer", "num_comments": 0, "upvote_ratio": 0.67, "score": 3, "num_crossposts": 0, "comments": []}, "35": {"created": "2017-08-07 19:28:01", "title": "MiniWager Games: Beta Signup now available. Win free ether!", "num_comments": 0, "upvote_ratio": 0.71, "score": 4, "num_crossposts": 0, "comments": []}, "36": {"created": "2017-07-12 23:07:28", "title": "Prove private key ownership to websites using Ethersign", "num_comments": 0, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": []}, "37": {"created": "2016-08-05 09:01:36", "title": "Government Dapss", "num_comments": 0, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": []}, "38": {"created": "2016-03-28 18:02:40", "title": "THΞ GREEÐ PIT - http://thegreedpit.com", "num_comments": 1, "upvote_ratio": 0.7, "score": 4, "num_crossposts": 0, "comments": [["2016-04-16 22:59:14", "Don't hesitate to join us ! :)", 1]]}, "39": {"created": "2015-08-10 20:50:23", "title": "A faucet", "num_comments": 0, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": []}, "40": {"created": "2015-08-10 20:49:47", "title": "Ethereum Foundation multisig wallet", "num_comments": 0, "upvote_ratio": 1.0, "score": 6, "num_crossposts": 0, "comments": []}, "41": {"created": "2018-04-23 01:01:51", "title": "Junktion.io - A Cryptocurrency Marketplace", "num_comments": 0, "upvote_ratio": 0.72, "score": 3, "num_crossposts": 0, "comments": []}, "42": {"created": "2018-04-15 15:17:08", "title": "DEurovision.eu - new Ethereum DApp", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "43": {"created": "2018-04-11 14:43:59", "title": "Putting the “D” in Dapp", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "44": {"created": "2018-04-05 17:16:14", "title": "The most unique/interesting Ethereum dApp games you've seen or played", "num_comments": 5, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": [["2018-04-06 01:50:50", "Ethorse ", 1], ["2018-04-06 01:53:25", "[**klopp klopp klopp... clippity-clop!**](https://imgur.com/oFQr27W)", 2], ["2018-04-06 06:14:11", "Realize you're perhaps shilling or joking - but would appreciate a rationale in this case!", 1], ["2018-04-06 06:37:46", "Honest shilling here. They're still on testnet only but I've been playing with it since January:\n\nhttp://ethorse.com\nhttps://medium.com/@ethorse\n\nThe development improvements have been steadily coming and it's way more fun than Etheroll which is pure gambling. This at least allows you to bet on which coin will perform the best in the next 1 hr, 24 hr, etc. Genuinely excited to see them launch soon :)", 1], ["2018-04-06 06:45:49", "[**eth eth! clippity-clop!!!**](https://imgur.com/of4Rq6B)", 1]]}, "45": {"created": "2018-03-25 17:07:59", "title": "[Need feedback] Trump is tweeting again. Smart-contract based game. Predict the words from his next tweet.", "num_comments": 5, "upvote_ratio": 0.83, "score": 4, "num_crossposts": 0, "comments": [["2018-03-26 02:10:09", "So cool.\nIm in.", 3], ["2018-03-26 08:36:14", "How is the CEO incentivized to continue providing words? How are these words guaranteed to be from actual tweets?", 1], ["2018-03-26 08:37:53", "Your profits mapping is private but you made a public accessor anyway. You could have just made it public.", 1], ["2018-03-26 08:41:52", "Your bid function, and several others, take a word parameter when they could take an index. Indexes are cheaper because gas price includes transaction data.\n\nAlso, assuming your words are all less than 32 characters, a bytes32 would be cheaper than a string, and you should have used that everywhere instead.", 1], ["2018-04-04 20:30:40", "So cool, I´m playing it all nights long, wish there were more such games! By the way you guys can create it yourself using [MyWish platform](https://contracts.mywish.io/dashboard/create/?utm_source=com&utm_medium=redditV&utm_campaign=tc&utm_content=V0404greategame) to create smart contract with several clicks and no coding", 1]]}, "46": {"created": "2018-03-09 13:34:05", "title": "3D RPG Fighting Game dapp", "num_comments": 1, "upvote_ratio": 1.0, "score": 4, "num_crossposts": 0, "comments": [["2018-03-10 02:04:37", "[deleted]", 1], ["2018-03-10 02:57:56", "Thanks! Yeah our team is really excited about this.. Stay tuned for updates.", 2]]}, "47": {"created": "2018-02-23 15:47:12", "title": "Introducing Crypto Memes — The Game that takes Blockchain and Memes bonding further", "num_comments": 0, "upvote_ratio": 0.61, "score": 2, "num_crossposts": 0, "comments": []}, "48": {"created": "2018-02-08 22:47:51", "title": "Ether Dungeon: RPG Blockchain Game", "num_comments": 1, "upvote_ratio": 1.0, "score": 4, "num_crossposts": 0, "comments": [["2018-02-12 05:47:26", "really cool! Would love to see this developed more and maybe some outreach to pro gamers to give it a go. ", 1]]}, "49": {"created": "2018-02-01 14:20:40", "title": "Deploy Your First Ethereum Smart Contract on a Blockchain!", "num_comments": 2, "upvote_ratio": 0.87, "score": 6, "num_crossposts": 0, "comments": [["2018-02-02 06:27:13", "Great article - good to see a lot more of these popping up. \n\nAnyone here gives this a go?", 1], ["2018-02-04 03:29:51", "Glad to see another article to help people get started.  We just launched the BillionTix.com dapp.  I just want to offer a little advice...there are a lot of different articles on how to start your first dapp out there...DON'T RELY ON JUST ONE!!  Every programmer comes from a different background and starts at different levels.  \n\nIf the Truffle environment is not intuitive to you, try a different approach, maybe just develop directly in Remix like we did.  \n\nOur advice is to read as much as you can before you begin.  One of our biggest challenges was just deciding on a development environment and then setting that up to start programming.  Until there is a fully developed \"standard\" IDE for Smart Contracts, this is going to remain a challenge.  But for now, just use what you understand the best, what fits your programming skills, and have fun and create something awesome that will support this community.  It will only benefit us all in the long run!!", 1]]}, "50": {"created": "2018-01-29 17:54:28", "title": "Decentralized Derivatives dapp -- launched on mainnet", "num_comments": 2, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2018-01-30 18:22:16", "I've never quite understood derivatives, forgive my ignorance.\n\nIf you want an asset that tracks the value of Bitcoin, why don't you just buy Bitcoin? I get it when the underlying asset is something difficult to trade, for whatever reason, but that doesn't really apply to Bitcoin.\n\nI'm not trying to criticize, I'm just curious about how it's used and how it works", 1], ["2018-01-30 21:14:00", "Thanks for the question.  \n\nFor the bitcoin specific one, these products allow one side to go long Bitcoin, but the other party actually gets to go short Bitcoin (something very difficult to do in the space).  The underlying tech also allows you to do things such as multipliers (so you go long 5X the rate of BTC, as in if it moves 5%, your products value moves 50%).  \n\nAnd Bitcoin is just one asset.  Some of the real uses for products will come when you have things such oil prices, S&P 500 prices and more, all now tradable as tokens on the Ethereum blockchain", 1]]}, "51": {"created": "2017-11-25 20:34:01", "title": "Anyone know of any dapps or blockchain projects that are looking for interns?", "num_comments": 7, "upvote_ratio": 0.83, "score": 4, "num_crossposts": 0, "comments": [["2017-11-26 04:44:56", "Interns? More than likely not.\n\nFull applications and full time work, yes I can think of a few.", 1], ["2017-12-04 05:19:46", "What coding experience do you have?", 1], ["2017-12-04 14:45:48", "I'd love some help with a pet project im working on in my spare time:\nhttps://www.reddit.com/r/ethdapps/comments/7hfnlp/safeordapp_safeorscam_on_the_blockchain/?st=jartzprh&sh=12cdad41", 1], ["2017-12-27 18:00:17", "Not looking for an interns per se. But at http://zemos.io we'll be embedding other people's dapps, small or big. So it could be a chance to develop a trivial'ish app and still get some exposure. ", 1], ["2017-12-04 05:37:00", "Moderate with C++, Ok with Python, JavaScript, a bit in Java. Also beginner solidity.", 1], ["2018-01-16 14:15:40", "\"Welcome on board.\nPlease, sing in to get the perks.\"\n\nShould be...\n\n\"Welcome aboard!\n\nPlease sign in to get the perks.\"", 1], ["2018-01-16 14:18:08", "Also, when it auto-fills my Ether address, it won't let me submit it, despite the address being correct and matching MetaMask.", 1]]}, "52": {"created": "2017-11-11 13:07:43", "title": "Storing app logic on Ethereum at the moment.", "num_comments": 1, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": [["2017-11-11 23:42:06", "This has generally been my observation too. I too was super excited at first what Blockchain can enable because you keep hearing people talk about the rosy future, but then I actually started coding...\n\nI am sure these things will one day become more efficient, but currently see no way to build complex contracts to work at scale with the current state of the technology.\n\nThis is not just about a single piece of technology, but virtually every aspect of the blockchain ecosystem is primitive at best. There aren't good enough debugging tools, you can't even return complex data structures from the blockchain so must resort to fetching multiple addresses and making another batch request to fetch detailed info for each item, you can't store much on the blockchain, they say swarm will solve this problem but at this point they're pretty much busy what IPFS has been doing for the last couple of years and what makes it sadder is IPFS itself is far from usable. A lot of official libraries for accessing Ethereum (testrpc and web3.js) are still pretty much in early stages and have bugs and lack some crucial features, etc.\n\nAnother thing I noticed was there is extreme shortage of people actually working on improving these underlying technologies. Most people are selling the \"story\" (the stuff you read about in Blockchain pop science books that have become popular in the last couple of years) when it won't be anywhere near feasible at least for a couple of years. Which means most people who do these ICOs have not touched the low level blockchain code nor understand what's going on. This is probably why they are so out of touch (or another much more likely possibility is that they're conmen who do realize the limitations yet still push for it, but I think for the reasons I mentioned above there are only few of these people. Most people don't even understand the low level technology of blockchain and therefore have no understanding of its limitations)\n\nWhat I think will happen in the next few years is most of these ICOs will come crashing down, not just because they're scams, but even the legit ones will crash because the tech isn't just there yet and at least the legit ones will probably focus all their efforts on improving the infrastructure. But these things take time, and a lot of their employees will get burned out and move on, which is where the crash will come from.\n\nAnd after all these ICO orgs shut down, they will have left a legacy which is the improved infrastructure. And then we'll probably see more meaningful DApps.", 3]]}, "53": {"created": "2017-10-25 16:45:01", "title": "I made a DApp that puts love locks on the blockchain (currently on Rinkeby)", "num_comments": 7, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": [["2017-10-26 04:45:27", "Love this!", 2], ["2017-10-26 06:14:00", "Amazing! Great concept", 2], ["2017-10-26 23:44:28", "This is cute!", 2], ["2017-10-28 01:18:47", "This is great. Here a look at our DApp:\n\nWe are happy to announce the Android launch of our new app Cryptibles. Cryptibles provides the easiest way to create your own ERC-20 Token / Digital Collectible. We use a special ERC-20 Contract that stores additional information about the asset. Our app decodes and reads that extra info to display 2D images or 3D models. Since all the tokens created are 100% ERC-20 they can be transferred and traded independent of our app :). \n\n\nIf you would like to check it out, you can download the android version from the Play Store:\nhttps://play.google.com/store/apps/details?id=com.lucidsight.cryptibles\n\n\nIf you're interested in beta testing our iOS app, send us a message and include your apple email.\n\n\nNow the good part:\n\n\nFor all those who would like to create their own ERC-20 token for free, the following code will redeem 11,500 of our in-app currency - CryptiBtyes - which will cover minting one set of Cryptible ERC-20 Tokens, transferring it to any ethereum address, and getting some additional packs of Cryptibles. The code is first come first serve and will allow 10 users to claim it before it expires.\n\nWe also have some really neat Cryptibles that our team has made, including a set for Halloween.\n\nCODE: 2j999hjky\n(To claim the FREE CryptiBytes go to “INBOX” in the app menu and select “Enter Code”)\n\nENJOY and please do send any and all feedback or suggestions. We would love to hear your thoughts on the app and how we can improve it.\n\nWebsite:\nwww.cryptibles.com\n\nYoutube Preview Video:\nhttps://www.youtube.com/watch?v=qldr332f14E\n\nEmail us for Beta Access:\ninfo@cryptibles.com", 1], ["2017-10-26 05:32:13", "thanks!", 1], ["2017-10-26 06:15:10", "Hey, thanks!", 1], ["2017-10-27 03:07:09", "hahah <3 ", 1]]}, "54": {"created": "2017-10-15 08:00:43", "title": "Sensay: decentralized, interoperable platform that allows human capital to trade across centralized messaging applications", "num_comments": 1, "upvote_ratio": 1.0, "score": 4, "num_crossposts": 0, "comments": [["2017-10-16 13:09:10", "very interesting project!", 1]]}, "55": {"created": "2017-08-21 11:37:36", "title": "Visual Overview of Agrello", "num_comments": 0, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": []}, "56": {"created": "2017-08-02 17:05:09", "title": "Introducing FuckYouDotEth: The Front Page Fuck You of the Internet", "num_comments": 0, "upvote_ratio": 0.6, "score": 5, "num_crossposts": 0, "comments": []}, "57": {"created": "2017-04-17 21:30:47", "title": "EtherSummary – an Ethereum news site that condenses hand-picked interesting stories into 7-sentenced versions", "num_comments": 0, "upvote_ratio": 0.76, "score": 4, "num_crossposts": 0, "comments": []}, "58": {"created": "2017-02-10 21:42:14", "title": "Become king of the fishes!", "num_comments": 2, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": [["2017-03-16 05:58:59", "this is awesome guys!", 2], ["2017-03-30 10:50:01", "Shark kill me", 2]]}, "59": {"created": "2017-02-02 14:14:12", "title": "Proof of Idleness", "num_comments": 6, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": [["2017-02-03 21:40:41", "If you get eliminated, I assume you can you rejoin?\n\nIt seems like players could automate this and the game could last for ever.", 2], ["2017-05-29 14:12:53", "I'm just beginning to browse through some Dapps - I'm impressed by how powerful they can be.\n\nA technical question for you: how do you go about testing something like this?", 1], ["2017-02-06 18:26:45", "(To be clear, you can only get eliminated if you didn't call the idle function in the last 27 hours.) If you get eliminated, it is true that you can rejoin the game (either with the same address, or with a new address), but you have to pay 1 ETH again. So avoid getting eliminated :)\n\n(Technically, for the contract, either an address A is currently playing, and lastPing[A] > 0, or it's not playing (or has been eliminated), and lastPing[A] == 0. If an address is not currently playing (lastPing[A] == 0), then it can join by paying 1 ETH (regardless of whether it's a new address, or an address that was eliminated). \n\nPlayers can automate the idling (call to the idle function every day), but mistakes always happen (automation error, power outage, ...). Having played myself for the last couple days, it's not easy to remember checking the contract everyday! \nBut I agree if there are some dedicated players in the game, then the game might last for a long time.\n\nI hope everything is clear, please ask more questions if need be.", 1], ["2017-05-29 17:49:12", "I tested the game using \"testrpc\", and then on the Ropsten testnet. There is also a testing framework called Truffle that allows you to test smart contracts.\n\nIf you're interested, have a look at the [new version of the game](https://www.reddit.com/r/ethereum/comments/6d8c3r/proof_of_idleness_metronome_app_now_live_3_eth/)!", 1], ["2017-05-29 14:47:39", "> but mistakes always happen (automation error, power outage, ...)\n\nI'd think this is going to be on the order of years in that case. If it ever resolves.", 1], ["2017-05-29 17:47:11", "This game ended in a few weeks! I was the only one playing, with just one other player. I didn't use automation, but in the end I won.\n\nI have just released a [new version of the game](https://www.reddit.com/r/ethereum/comments/6d8c3r/proof_of_idleness_metronome_app_now_live_3_eth/) where you can invest as much as you want (and withdraw at any time). If you don't idle, then you don't get eliminated, but 10% are taken from your balance, and redistributed to all players.\n\nThe game is fair regardless of whether you invest small or big (with a big balance you stand to lose more, but you stand to win more from other players losses, so it evens out).", 1]]}, "60": {"created": "2016-12-26 15:00:24", "title": "EtherLovers - blockchain-based lovers list", "num_comments": 1, "upvote_ratio": 0.84, "score": 4, "num_crossposts": 0, "comments": [["2017-03-29 12:32:06", "pretty cool!\nIs the code open source? Would love to take a peek.", 1]]}, "61": {"created": "2016-12-15 08:00:11", "title": "Looking for Solidity Dapp Development Partner", "num_comments": 2, "upvote_ratio": 1.0, "score": 4, "num_crossposts": 0, "comments": [["2017-02-10 04:41:57", "Adonis_2115, I wish that I knew solidity and more about Dapp development.  Alas, I cannot help you, except to suggest that you make your request in this sub-reddit:\n\n\"I need a team\" (INAT)\nhttps://www.reddit.com/r/INAT/\n\nI hope that you find someone who can help you.\n", 1], ["2017-03-19 03:40:09", "Hi Adonis_2115. Yes. I'm working on something, and interested to hear if you are too.", 1]]}, "62": {"created": "2016-11-13 23:51:58", "title": "TimeClock - Open Source Labor hire / service delivery contract", "num_comments": 0, "upvote_ratio": 1.0, "score": 4, "num_crossposts": 0, "comments": []}, "63": {"created": "2016-09-24 14:13:41", "title": "What is the favorite and popular dev tools or framework for ethereum app?", "num_comments": 2, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2016-11-14 08:48:49", "I've used a combination of:\n\n* Truffle (Unit testing, javascript libraries):  https://github.com/ConsenSys/truffle\n* Testrpc (For the unit tests to run against): https://github.com/ethereumjs/testrpc\n* Atom editor: (https://atom.io/)\n* Geth and Ethereum Wallet against a private chain for user/ui testing.\n* Geth and Ethereum Wallet for production deployment\n\nWhilst unsure if this is the best way to do it, it was workable for me.\nOutput can be seen here: https://github.com/dmozzy/TimeClock ", 4], ["2016-09-30 07:09:49", "I think this is a great question. It's disappointing that nobody has answered, but OP might want to try a larger sub since this one only has 440 readers.\n\nAnyway, a few months ago I tried developing a DAPP using AlethZero (they're up to AlethOne now). It was a fairly miserable dev environment, but it worked. I'm very curious to hear if there's a better option.", 1]]}, "64": {"created": "2016-06-29 23:03:30", "title": "Rouleth.com : Play the roulette on Ethereum !", "num_comments": 3, "upvote_ratio": 0.57, "score": 3, "num_crossposts": 0, "comments": [["2016-07-04 20:45:52", "[deleted]", 1], ["2016-07-04 20:49:54", "As long as there is no wallet browser there is no other way to play than via transaction data or importing the contract in mist.\n\nWhat do you find so hard to use ? The fact that you have to use 2 transactions ? (one to bet, one to spin )\n\nYes I'm working on some solutions to make the dapp even easier to use.", 2], ["2016-07-04 20:48:06", "Glad I have your vote in 2016!", 1], ["2016-07-04 20:58:43", "[deleted]", 2], ["2016-07-04 21:29:47", "Thanks for the kind words.\nYes it's very experimental and new for now. But I think that we are not so far from easy playing.\nIf for instance Jaxx can somehow import contracts and allow users to select their functions via names and not transaction data, we would be very close to easy use.\nIf I also implement some mechanism that allow the user to play in one transaction, I think this could all become rather smooth ;) But yes it's not so easy for now, you are right\n\nPlease don't hesitate to give us your feedback in the future, they are very appreciated and important for us developers to tailor dapps that fit our users needs and wishes :)\n\n\n", 2]]}, "65": {"created": "2016-03-14 02:15:52", "title": "www.etherwheel.io - A simple lottery with user-friendly interface.", "num_comments": 12, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": [["2016-03-14 10:55:26", "While I appreciate that this is a small-value application, I *really really really* wish that people would stop using blockhashes for randomness. \n\nThe argument that miners won't cheat because the value of each \"wheel\" is under 5 ETH is flawed. **What matters is not the amount in each wheel, but the amount decided by each block**\n\nThis includes not only the Ether in your DApp, but in all DApps relying on this blockhash. While the net cost of discarding a block is 5 ETH (less actually, since the block can be published as an uncle), the **marginal** cost of checking another DApp to decide whether or not to discard is near zero. Thus the **total** amount of money resting on the blockhash must be less than 5 ETH. \n\nAlso, using blockhashes for RNG is not Serenity-proof. It works for now, but will eventually break when PoS goes away.\n\nMy suggestion is to use either a BTC blockhash via BTC-Relay, a random.org call via Oraclize with on-chain TLS Notary (coming soon), or one of the methods [here](http://ethereum.stackexchange.com/q/191/131)\n\n\nEdit: I don't want to come off too harsh, and I'll gladly help you implement a more secure RNG, if you'd like.", 5], ["2016-03-23 10:54:57", "my name jeibjf", 1], ["2016-03-14 11:14:44", "I appreciate the feedback, and I realize that it's not a perfect solution, but I chose to use the blockhash since I prefer the idea of it living entirely on the blockchain, without it needing to rely on any outside sources. I could be mistaken, but I personally think the chances of this flaw in the implementation having any substantial impact in the real world are slim to none.\n\nI'm still new to Ethereum -- could you explain what will change in Serenity to invalidate using blockhashes for RNG?\n\n\n", 2], ["2016-03-20 22:41:05", "Can you provide a link to some data about why block hashes are not random?\n\nGoogle found an answer for me:\nPedantic answer: No, they're not random, because the first twenty digits or so will always be zero.\n\nhttp://bitcoin.stackexchange.com/questions/31916/random-numbers-using-blockchain", 1], ["2016-03-23 11:09:14", "What? O_o", 1], ["2016-03-23 22:39:06", "No, it's not", 1], ["2016-03-14 11:43:26", "What makes the blockhashes secure(ish) is that it is difficult to find a hash that qualifies to be published. This is the essence of Proof of Work, that finding valid blockhashes is computationally difficult. \n\nSince by giving up a blockhash, you are also giving up the right to publish the block, it is expensive to discard the hash.\n\nWhen we switch to PoS, the blockhash will no longer be the deciding factor in what block gets published, so it is no longer has the same restrictions, and can be manipulated to the miner's content by just rearranging transactions and such. \n\nI get that you want to keep everything on-chain, and I'd like to point out that fully-decentralized NMC is fully on chain, although everyone would need to come back to \"spin\" the wheel after it is filled. \n\nI also think you should consider using BTC-Relay. It's totally trustless, and BTC blockhashes are far more expensive to throw away than Ethereum hashes. ", 2], ["2016-03-21 00:25:15", "The third answer in that link is the one that's applicable here. Miners can choose to not publish a block if the hash will not make them win. They forfeit the 5 ETH reward, but they can still get the uncle(~3ETH) reward. So if the value of the lottery is more than a few ETH, the miner can cheat by not posting loosing blocks. \n\nSee http://ethereum.stackexchange.com/questions/191/how-can-i-securely-generate-a-random-number-in-my-smart-contract for a solution", 1], ["2016-03-21 06:00:09", "Ok, but that seems really unlikely to frequently occur since blocks happen ~15 seconds, there are many miners competing and the prize is likely less than the block reward.  Right?", 1], ["2016-03-21 06:16:04", "The short block time doesn't really matter, it just decreases the variance in the cheater's return. \n\nI don't think 2-3 ETH is that much for the sum of all lottery rewards on the blockchain, do you?\n\nAlso, keep in mind that DwarfPool currently has > 40% of the hash rate, so they could easily get 2 blocks before the next miner does", 1], ["2016-03-21 06:28:15", "In my mind, if you are smart enough to pull that off, good for you.  Seems way to unlikely to worry about.", 1], ["2016-03-21 06:38:55", "It's actually been pulled off successfully before. I'll try to find the example. \n\nIn an ecosystem filled with incredibly intelligent people, I wouldn't recommend taking too many risks like this. Sure it's fine when the pot is 20 ETH, but do you really want to run a lottery that can't have a big pot?", 1]]}, "66": {"created": "2016-03-13 07:48:21", "title": "New DAPP - \"Government Simulation\": game theoretic variation of simple Ponzi - 1000ETH Jackpot", "num_comments": 6, "upvote_ratio": 0.72, "score": 3, "num_crossposts": 0, "comments": [["2016-03-14 07:17:06", "Cool idea. Where did* the 1000ETH jackpot come from?", 1], ["2016-04-01 08:34:58", "When does the 10% get returned? If I send 1,000ETH when will I get the 1100 back? And will I get it all at once?", 1], ["2016-03-14 13:10:27", "I put it in. I actually think it will run for a very long time so I hope to get the 1000ETH back over time with fees. But no one can now - lets see what will happen - at this point no one can control it more then all others.", 2], ["2016-04-03 15:44:52", "If you send money to contact you will be added to the list of people that the contract will send money. So if you send 1000ETH today a part of it will be used to pay out people before you. A big part of it will remain in the contact and when the contact has enough money to pay you the 1100ETH it will.\nIt might be a good idea to use a few chunks - then you get payouts faster as soon as one chunk is ready. That said - of course payouts are not guaranteed - it is a Ponzi after all. However - because of the big jackpot it is very likely that it will continue to run (and therefore payout) for a long time (months or even years)", 1], ["2016-03-14 13:22:49", "Interesting gamble. I will definitely put some in as soon as I proofread your code ;D", 2], ["2016-03-15 03:47:40", "let us know what you think of the code! In some way we put a 1000ETH bounty in it :)", 1]]}, "67": {"created": "2015-08-15 12:31:27", "title": "HonestDice - Dice game", "num_comments": 2, "upvote_ratio": 0.72, "score": 3, "num_crossposts": 0, "comments": [["2015-08-15 21:03:00", "A total noob here trying to understand the basics. \n\nWhat do you mean by \"our server\"? \n\nIs it a part of Ethereum platform? \n\nOr is it a computer outside of Ethereum, like a regular server? \n", 1], ["2015-08-15 22:20:11", "It's outside the blockchain. It detects updates to the contract and then sends messages to the contract.\n\nAll funds, functions and operations are still on the blockchain, just a random seed is supplied by our server to prevent cheating", 2]]}, "68": {"created": "2015-08-10 20:54:01", "title": "King of the Hill", "num_comments": 0, "upvote_ratio": 1.0, "score": 5, "num_crossposts": 0, "comments": []}, "69": {"created": "2015-08-10 20:53:14", "title": "100 Eth Pyramid", "num_comments": 0, "upvote_ratio": 0.65, "score": 4, "num_crossposts": 0, "comments": []}, "70": {"created": "2018-04-18 10:49:58", "title": "I made a decentralized pixel canvas (cryptopixels.net)", "num_comments": 0, "upvote_ratio": 0.83, "score": 4, "num_crossposts": 0, "comments": []}, "71": {"created": "2018-04-13 21:34:49", "title": "Creating Ethereum Poker online without a bullshit ICO. Read the pdf on the general idea (inspired by FunFair) - feedback appreciated! (Also join /r/ethopolis)", "num_comments": 6, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": [["2018-04-14 15:45:04", "Unless you really have an `@mail.com` account, you probably meant `gmail`.\n\n---\n\nOne of the main reasons why funfair doesn't have a poker game is that there's no way for anyone to verify that all other players in the game aren't colluding. The might all be the same person for all you know, which gives them an unfair advantage.\n\nHow are you planning to solve this?", 1], ["2018-04-14 17:31:58", "No it's an @mail account because I can't create another gmail account since I don't have another phone number.\n\nYou cannot solve that problem on-chain, you need off-chain checks for that.", 1], ["2018-04-14 21:51:13", "Doing only heads-up poker would be one approach.", 1], ["2018-04-15 02:44:58", "What about incorporating Civic with each accounts + whitelisting only one ETH address to fund/withdrawl like Coinpoker did?", 1], ["2018-04-14 22:04:39", "Right, I was hoping the dev would say that but they didn't. :/", 1], ["2018-04-15 02:53:48", "That can help with one part of the problem - all players in the game is not the same person.\n\nThe game can still be manipulated if all players, except one, are different individuals who are colluding against the one player who isn't part of their ring.", 1]]}, "72": {"created": "2018-04-11 19:39:58", "title": "One Million Pixels", "num_comments": 1, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": [["2018-04-12 03:40:24", "Airdrop in original post - https://www.reddit.com/r/OMPx/comments/8bjvie/one_million_pixels/", 1]]}, "73": {"created": "2018-03-29 11:37:34", "title": "All For 1: A fully decentralized raffle game that chooses 1 out of 100 players to win the whole jackpot", "num_comments": 9, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": [["2018-03-29 20:51:23", "I'm back. Okay just bought ticket #2 for this round. The site looks great. Slick & I was pleased with the ticket price of 0.005 ETH. This is actually really cool. I'm sure tons of people will be happy to toss in $2-$3 of ETH for the chance to win. Might be good to have a link connect a chat room on Telegram for players to hang out in.", 4], ["2018-03-29 20:44:24", "My dude! I was just searching for something like this yesterday. Will have a look + get back to you.", 2], ["2018-03-30 02:09:12", "Interesting DApp you have here. I have a few pieces of advice having looked at the code:\n\n1. Be careful using now for random number generation. If a miner was participating in this raffle he could control the value of now in order to allow himself to win.\n2. The formula for the winner has nothing to do with anyone’s number. The 100th persons number simply decides the winner with =keccak(now+(keccak(now+number)/now))%100 + 1\n2.1. This formula is pretty now heavy as well as dependent on a user input which makes me feel like someone comfortable with blockchain manipulation or who knows keccak really well could just always be the 100th person and make themselves or someone else purposely win.\n3. Transferring the winning funds to the winner is one thing, but transferring funds to yourself is something you should try to avoid. Even sending the winning funds is a bit risky but in this case fine. In the future though, remember solidity encourages a withdrawal pattern. Why should each user pay the gas for sending you 1% of their winnings, when instead that could just be kept track of by the contract and you could withdraw all collected fees whenever you want. Cheaper for users, and as cheap as possible for you.\n\nIf you have any questions or just want to discuss stuff I’d love to chat!", 2], ["2018-03-30 14:53:45", "I just went in to take a second look at your contract and believe I found two flaws.\n\nThe first is the possibility of locking up your contract, and goes back to a withdrawal mechanism.  If a bad actor chose to create a contract that can call your functions but has no callback (and so it can't accept ether sent to it) they could potentially lock up your contract when it tries to send ether.  Now I believe, THIS specific contract is safe as someone else could just be the 100th better, but keep it in mind.\n\nThe second which I think is an actual issue, is it looks like you take 10% and not 1% as you've stated in this thread.  I think this because you multiply the current bet (the amount each person needs to bet) by 9 and send that to the winner.  You multiply it by 1 and then send it to yourself.  For one, that only adds up to 10bet instead of the 100bet that should be in the contract.  The second is that even if the math is correct, it has you taking 10% instead of 1%.  Now maybe you deserve 10%, but I figured I'd point it out so you could decide whether to change the post or the contract ;).", 1], ["2018-03-29 20:55:59", "Thanks for the comment, really appreciate the positive feedback! I'm actually working on getting a chat implemented that maybe slides out from the right side, definitely would help to keep people interacting", 3], ["2018-03-30 04:18:23", "Would a player be able to realistically figure out what the playerKey would be by the time the 100th player is required(since it's changing based on the players input as well)?\n\nI'm trying to think what exactly a miner would need to accomplish to break the system, he'd have to make sure he finishes the block containing the 100th play right? Then what, would he view what the playerKey is, edit his input + the time based off what the key is in order to find a number where the modulus would equal 99, to get 99 + 1 (100th player). Or would the miner essentially be buying any random ticket, recording what number they are, then when the last ticket comes through, ensure that the now time + the uint that was input is equal to a number where the modulus gives them the number they are (how would this math work? There's a lot more to look out for than I thought..)\n\nAs for transferring in the winning funds, definitely hearing you on that. On any other basis I've been using the withdrawal pattern, but I figured that if there were less money in the contract at any given time, it's less incentive for some evil genius to come up with the next reentrancy attack using my game.\n\nTrying to figure out what I would need to do to the RNG to make it less susceptible to miner interference, perhaps store all the playerKey inputs separately and concatenate them in a hard-to-predict way at the end(essentially just jumble the order up)? That way it isn't just 1 visible number that's used, but the first 100 keys of a mapping for example (all 100 bets). Think that still wouldn't be sufficient?\n\nAppreciate the comment, it has me thinking a lot about security and what I can do to improve it, going to continue testing on the test-net, thanks a lot!", 2], ["2018-03-31 19:14:42", "Heya, I've deployed a new contract, the thread discussing it can be found here:\n\nhttps://www.reddit.com/r/ethdev/comments/88h07f/back_with_i_think_a_better_rng_system_for_my/\n\nThe percentage you saw before was simply because the game was using 10 users not 100, so it took 10% not 1%, regardless I've removed house cuts completely and the game now disburses everything back out.", 1], ["2018-03-30 04:34:44", "Happy to see there’s some real developers on here looking to improve and make neat apps.  I hadn’t thought much past what the attack vector would be, so you’re thoughts on how to actually do it are interesting. I imagine submitting 3/4 tickets and then the 100th could allow you to hash the block and if you don’t like the result of who was picked to win, you rehash with the a later time. Nothing wrong with taking a minute to “find” the correct hash even after you’ve found it.\n\nAs for generating random numbers best, there are oracles but you need to trust the source. And so for true random numbers for use in applications, it’s pretty tough to do. THANKFULLY you don’t really want to generate a random number, you’re ok with calculating a random number that can’t be predicted. Check out https://ethereum.stackexchange.com/questions/191/how-can-i-securely-generate-a-random-number-in-my-smart-contract and the top answer explains a really neat system that works like yours. It’s one of my favorite pieces on generating random numbers, and also uses a great paradigm of revealing things on the blockchain after everyone has submitted the hashes. Very similar to ENS blind auction actually.\n\nThinking about reducing the risk of having funds stolen is smart, it’s just disappointing we can’t rely on good practices due to potential vulnerabilities. Keep up the great work and I hope to see more of your work!", 1], ["2018-03-30 06:14:06", "First off, thank you so much for saying \"real developer\" haha, definitely an ego boost there, when I've really only played around with coding in the past and only seriously have attempted it for about a month now. I've deployed a test contract on the Ropsten network for now that chooses players out of 10 instead of 100, for testing purposes.\n\nGoing to try implementing the commit + reveal strategy that you linked, I really like the way it works and am thinking of ways to improve on it. I'm trying to refrain from using Oracles, so this will definitely be an interesting challenge.\n\nThanks for such a detailed comment, I really appreciate it, admittedly I started designing and coding this smart contract just 2 days ago, so I'm not surprised to run into a few hiccups.\n\nYou can check out the new test contract here:\nhttps://ropsten.etherscan.io/address/0x6f35a09650561d4f2397679ab02caba49db0dc96#code\n\nOr you can visit the site:\n\nhttp://www.allfor1.io", 2]]}, "74": {"created": "2018-03-19 01:33:59", "title": "A dApp for marrying on the blockchain. Currently on Rinkeby and Kovan. Input greatly appreciated!", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 1, "comments": []}, "75": {"created": "2018-03-17 20:16:58", "title": "My First Ethereum Smart Contract: Guess the Number!", "num_comments": 14, "upvote_ratio": 0.8, "score": 3, "num_crossposts": 0, "comments": [["2018-03-18 10:30:13", "Nice honeypot, especially this sentence: \"If you find a way to cheat or break the contract, take the eth but please just let me know how so I can learn\" made you bait some people.\nObviously, the storage pointer made with GuessHistory plus the above require makes impossible to \"guess\" the number, and at some point you will collect the ether of the poor greedy people that failed to win.", 6], ["2018-03-18 06:07:42", "Pretty sure you can read private variables on the blockchain, but this could just be a honeypot", 3], ["2018-03-18 06:46:17", "Well the good news is I broke it!  The bad news is, I didn't do it in the way I expected.\n\nSo first of all lenopix is correct in that the value of the number can simply be looked up using web3.eth.getStorageAt...\n\nBut I didn't do it the easy way, instead I took the value of now from when you deployed the contract and did the hash and modulo myself to find that they both gave the same value.\n\nAnd then I made my guess that the number was 9 (which was correct) and that then changed the numbers value.  This is due to  a (bug/feature???) of Solidity where if you don't create your structs with the memory keyword, they use the same space as your contract allowing you to override the values.\n\nMy address (0xb5...) is now the correct value for the guessable number and the lastPlayed variable would be equal to my guess (the second value in a GuessHistory struct) but was overridden with the correct value of lastPlayed as that line comes after.\n\nIf you could self destruct the contract and send me back my .11 ETH [or the full .21 ;)] that would be greatly appreciated.\n\nI looked over your code quite a lot in order to prevent this exact situation from occurring but this is a weird thing only solidity does that I always forget and it came back to bit me.  A few pieces of advice based off your code though:\n-Great job including an empty fallback function.  Now no one can accidentally submit funds to you.\n-Having a kill function is always a good idea (especially this time) and there seems to be no issues there.  Do keep in mind though that had \"owner\" been the first variable in your contract and not the number, I would have become the owner of the contract.\n--I then could kill the contract or let it run (with you unable to kill it) and then I would be able to do as I wished with it.\n\nRandom numbers on the blockchain are always risky so it's best if your user gives the number (maybe along with a deposit and if no one can guess the number after X tries the user gets his original deposit plus all the bets).  What you do with the user given number, is hash it and store that hash for later verification.\n\nLook at [this](https://programtheblockchain.com/posts/2018/03/16/flipping-a-coin-in-ethereum/\") for more information on random number games.\n\nLook at [this](https://github.com/ethereum/solidity/issues/3469) for a report on the bug you encountered.  Make sure to read all warnings given to you (hopefully you are using Remix as your compiler) in order to prevent these errors from occurring.", 2], ["2018-04-04 20:23:51", "High five bro! I also created Ethereum smart contract using [MyWish](https://contracts.mywish.io/dashboard/create/?utm_source=com&utm_medium=redditV&utm_campaign=tc&utm_content=V0404chilling) platform. And I don´t even know coding, MyWish allows to make contracts with several clicks with no special skills. Let others learn programming or hire specialists, guys like us can make money creating smart contracts while chilling in the evening", 1], ["2018-03-19 00:52:06", "Indeed. It exploits a class of bugs that was recently discussed here as well. [Here's an explanation](https://medium.com/cryptronics/storage-allocation-exploits-in-ethereum-smart-contracts-16c2aa312743).", 2], ["2018-03-18 06:13:06", "Private variables simply means they can’t be changed or accessed within ethereum.\n\nOutsiders like us simply need to look at the blockchain. You would need the ABI or some time though to find where the value is stored.", 2], ["2018-03-18 07:19:10", "Gotta love the edit where you added could just be a honeypot.  If it is, it's a well designed one as they would have known the value would be overwritten and that's why they specifically choose to make it so that the value had to be less than 10 and is why it was easy to see the correct answer.\n\nHere's to hoping it's not though!", 1], ["2018-03-18 07:05:16", "I've just attempted to recover the funds I lost with a different account.  In order to do this I submitted my address as my guess for the number (as the number will be set to it before checking) which would have worked, if it hadn't been for the check to make sure the guess is < 10.\n\nSo unfortunately my fate is in your hands, please return the funds and have a great day!", 1], ["2018-03-21 00:56:49", "Really great read, especially on how to beat him at his own game.  You can see in a reply below how I (the first guy to fall for the honeypot) tried to game the system after the fact by guessing the number as my address so it’d be correct no matter what. Unfortunately he planned for that which is why the number has to be less than 10. If anyone has the addresses from 0-9 you could be our hero.\n\nIt looks to me like this person put as much time testing this scam as I do making sure my contracts are bullet proof in a good way. Pruning away these darker developers will be necessary in the future or we at least need better ones in the light.", 2], ["2018-03-19 01:26:59", "I'm 95% sure you got scammed. On the plus side it's only 150$ thanks to current market conditions...\n\nThe whole `GuessHistory` just doesn't make sense, it's not even stored in an array or so. It's just too much of a coincidence. The only purpose it servers is overwriting the `randomNumber` (and `lastPlayed` is just there for padding, so that `minBet` is not overwritten). And as you figured out, the only way to retrieve the Ether is by either being the owner or by controlling an address between `0x0` and `0x9` inclusive (which is highly unlikely).\n\nAlso OP created a Reddit account just for this purpose, so I really don't think they have good intentions.", 2], ["2018-03-19 01:45:05", "Yeah I realized immediately after I had been scammed. The idea of helping a young solidity programmer made me so happy that I immediately looked over the fact that someone testing an app wouldnt make the minimum .1 (but it may change due to market price of ETH) and all the bull with a throwaway.\n\nOn top of that I knew for sure that I was screwed when I found a way to recover my funds (by guessing my own address) and realized he made the number less than 10 for that exact reason.\n\nHonestly I could care less about the money, (even though it’s more like $120 based on where ETH price should be) I care a lot more that some sad sack took his knowledge of solidity (which he at least knows enough to know about the struct issue) and wasted it on scamming me and another guy out of $200.\n\nEither way I can watch where the money goes after he pulls out (I’ve already followed it backwards to an account holding 11 ETH so I hope the extra .2 adds a lot to his collection).", 1], ["2018-03-19 02:30:39", "I agree there - I too am very disappointed that someone with advanced Solidity knowledge is trying to scam other developers.", 2], ["2018-03-21 00:34:19", "On the plus side: Just by giving that detailed explanation, I (entirely unrealted to OP) did learn about a new class of bugs that I didn't know about before. Thanks and kudos for that!", 2], ["2018-03-21 00:39:04", "Happy to hear. It’s one of those bugs that can be devastating (it’s a big way ownership of a contract gets stolen) and I often forget it due to how easily it can be avoided.\n\nHave a great day and develop something awesome for us all!", 1]]}, "76": {"created": "2018-03-17 16:25:39", "title": "Ethereum game for conquering territories and earning Ether", "num_comments": 2, "upvote_ratio": 0.8, "score": 3, "num_crossposts": 0, "comments": [["2018-03-20 04:12:27", "first contest at https://cryptoconquest.io/marketplace starts in less than 2 hours and lasts for next 24 hours\n\nprize pool is 0.139 ETH.\n\nFloor prices are still pretty low.\n\nget 0.015 eth worth territory just by joining our discord (one random person will be chosen): https://discord.gg/bwDw3z", 1], ["2018-03-18 01:49:12", "Meh.....", 1]]}, "77": {"created": "2018-03-14 11:20:52", "title": "dueltoken.io - decentralized and platform-agnostic gaming duels and challenges powered by smart contracts and the community", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "78": {"created": "2018-03-13 15:59:45", "title": "Crypto Sportz is live! Come enjoy the simplicity and security of a decentralized sports wagering platform. Place your bets on NBA, UEFA, FIFA, NFL, and all major leagues!", "num_comments": 5, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2018-03-14 00:42:36", "So your model is a parimutuel model based on betting exact scores?", 1], ["2018-03-14 02:02:16", "Parimutuel model based on team1 win/team2 win/draw for now. Expanding in the near-future with survival pools and more.", 1], ["2018-03-15 17:07:02", "What advantages do you offer over SportCrypt which I currently use? \n\n", 1], ["2018-03-19 02:20:38", "We have nothing but love for the few other groups trying to pioneer decentralized sports betting, so not looking to have anyone switch unless it's coming from a traditional bookie. Sport Crypt have build a solid product and we applaud them.\n\nTo answer your question in detail:\n- Cleaner interface\n- No need to fund an account, you send ETH straight to the game contract \n- Active and growing community in social, Telegram, etc.\n- Various game types. We already have games where you predict the score of a soccer game against other's predictions. We have pick a winner, but in a pari-mutuel format. Survival is coming as well as sport lines on multiple games, etc. \n- We are continuously evolving our product and are highly engaged with the community (such as here)", 1], ["2018-03-20 00:46:49", "Cool, thanks for the response. \n\nYou may want to consider rebranding. The 'z' in sportz may be perceived to be unprofessional (just my opinion) and SportCrypt and the firm you represent have awfully similar names. ", 1]]}, "79": {"created": "2018-03-11 22:11:04", "title": "How Cryptogs Works", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "80": {"created": "2018-03-10 11:29:24", "title": "Cryptogs - Play pogs on the blockchain!", "num_comments": 2, "upvote_ratio": 0.67, "score": 3, "num_crossposts": 0, "comments": [["2018-03-11 10:17:41", "how is your game different from all the other ponzi/pyramid games?", 1], ["2018-03-11 21:22:17", "Hahaha. Have you played the game?\n\nI understand asking this question because nearly everything that comes out of this space has no gaming mechanics and is usually just a KittieCloneCashGrab. But this is not one of those games. There are no ponzi or pyramid mechanics to the game. It's pogs!\n\nHow is it different? Well, it's a game you can actually *play*. It's *not* a marketplace.\n\nYou have to pay a little for a pack of pogs because it costs us a lot of gas to create them. But then you have all you need to play the game. \n\nThose pogs you purchased aren't going to increase in value. \n\nThose pogs don't pay out to other people who purchased them before you. \n\nYou can't sell those pogs on our site. We aren't a marketplace. We are a game. \n\nThere are external ERC-721 markets but that is just another awesome thing about the blockchain; you own your assets and you can do whatever you want with them!\n\nSome pogs we mint less of to create a feeling rarity like the real world, but I don't understand where you get the ponzi/pyramid scheme thing from? \n\nThis is meant to be a fun game, with solid randomness, that is played all on-chain. If there is anything scummy here please tell me and I'll fix it.\n", 2]]}, "81": {"created": "2018-02-11 15:05:48", "title": "Interested in developing a SEC compliant crowd owned/funded public corporation? Come join the discussion!", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "82": {"created": "2017-12-27 21:37:12", "title": "Participating in an ICO from a wallet instead of a Dapp.", "num_comments": 2, "upvote_ratio": 0.8, "score": 3, "num_crossposts": 0, "comments": [["2017-12-28 07:43:46", "You'd have to serve up an API and build a frontend to issue the contract call. AFAIK there is no way to do this in MEW.", 1], ["2017-12-30 00:06:00", "I figured it out. If you have the JSON artifact of your contract, you can do:\n\n    const web3 = new Web3(new Web3.providers.HttpProvider(\"\"));\n    const emptyInstance = web3.eth.contract(Artifact.abi).at(\"\");\n    \n    const msgData = emptyInstance.transfer(\"to address\", 1000);\n\nAnd then when you're making a transaction with a wallet, you send ETH to the wallet address, and plug `msgData` in as the data (which you might need to enable by clicking \"Advanced\").", 1]]}, "83": {"created": "2017-12-25 18:39:00", "title": "0% fee decentralized exchange Radex", "num_comments": 8, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": [["2018-01-01 18:27:18", "font size and colors are too uncomfortable", 1], ["2018-01-24 11:21:40", "Just pushed an update! Changelog: https://forum.rados.io/t/development-update-january-22/158\n\nListed the first ERC20 token (ZRX) and opened up the vote for new ones.", 1], ["2018-01-01 23:06:36", "Thanks for the feedback! What color scheme would you find more appropriate? Since the exchange is decentralized we can trivially run multiple UI websites on top of the same smart contract", 1], ["2018-01-19 05:45:05", "Perhaps make the contrast between the text and the background a bit stronger (make text brighter).\n\nThe \"syncing\" thing was there for 10 minutes and didn't seem to be getting anywhere so I closed this before being able to really check it out", 1], ["2018-01-19 07:14:32", "We currently rely on metamask to pull data from the blockchain. Seems that metamask isn't doing too well these days, we're having issues ourselves. The good news is that Radex caches blockchain downloads, so the next time you open it you will resume downloading. Those 10 minutes did not go to waste!\n\nWe'd love to remove the metamask dependency, but outside of using parity or Mist there's no user-friendly way to access web3 in a trustless way.", 1], ["2018-01-19 07:27:01", "One common gotcha when it comes to MetaMask downloads is that you need to have at least 0.1 ETH on your metamask account in order for it to work decently. Everyone who has less than 0.1 ETH is getting severely throttled.", 1], ["2018-01-19 07:15:06", "We do greatly appreciate your feedback, thank you for checking us out!", 1], ["2018-01-19 15:11:58", "Consider putting this in the ui if the requests are timing out\n\n", 2]]}, "84": {"created": "2017-12-14 13:10:16", "title": "Want to meet LiveEdu team members? See us at this event and more.", "num_comments": 0, "upvote_ratio": 0.72, "score": 3, "num_crossposts": 0, "comments": []}, "85": {"created": "2017-11-27 17:21:24", "title": "Free hands-on Ethereum programming workshop in NYC this Friday", "num_comments": 0, "upvote_ratio": 0.8, "score": 3, "num_crossposts": 0, "comments": []}, "86": {"created": "2017-11-22 14:31:23", "title": "Stone Tablets. Imprint your text forever!", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "87": {"created": "2017-11-12 09:21:04", "title": "Proof of Authority: consensus model with Identity at Stake", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "88": {"created": "2017-11-08 14:21:25", "title": "The first smart contract powered retirement plan generator", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "89": {"created": "2017-11-06 19:33:49", "title": "Artists want to break free… a blockchain solution", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "90": {"created": "2017-10-26 16:26:08", "title": "There's a new tool for monitoring your smart contracts using the Etherscan API", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "91": {"created": "2017-10-15 19:09:39", "title": "Lightstreams: Distributed Content Publishing", "num_comments": 0, "upvote_ratio": 0.8, "score": 3, "num_crossposts": 0, "comments": []}, "92": {"created": "2017-09-21 16:39:35", "title": "Meta-mining on ethereum network concept", "num_comments": 3, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": [["2017-10-06 19:46:50", "Up. Anyone..?", 1], ["2018-03-09 18:35:12", "That's a fun experiment! Shows how simple Bitcoin is when you abstract away the mining.\n\nThough your contract only gave me 1 M3T! :D\n\nI guess this is the reason:\n\n    uint256 public blockReward = 1 * (10**uint256(decimals));", 1], ["2018-03-09 21:30:23", "Yep, reward is only 1", 1]]}, "93": {"created": "2017-09-20 14:48:54", "title": "Understanding the concept of DAPPs. Need help :)", "num_comments": 4, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": [["2017-09-21 02:56:16", "Hi,\n\nclearing data costs gas, so you shouldn't actually do that. Instead, store addresses in an array, have a counting variable and reset that one to zero. \n\nsee here: https://ethereum.stackexchange.com/questions/3373/how-to-clear-large-arrays-without-blowing-the-gas-limit\n\nbtw: The much larger challenge, though, will be to generate a proper random number, as I'm sure you'll soon discover :-)", 3], ["2017-09-21 18:56:26", "Thanks for reply :) But actually I am not completely sure how your suggested solution should work in my case. Because as I understand you are suggesting to have array something like this:\narray[1...100]\n\nand a counter which increases on each \"guess\"\n\nso it will work like this:\n1. Someone guesses number 4 => counter = 0; => array[counter] = 4, counter++;\n2. Someone guesses number 78 => counter = 1; => array[counter] = 78, counter++;\n....\n100. Someone guesses number 66 => counter = 99; => array[counter ] = 66, counter = 0;\nthen it starts again:\n1. Someone guesses number 5 =>  counter = 0; => array[counter ] = 5, counter++;\n...and so on...\n\nis this is the idea you are suggesting? Or am I misunderstanding something? Because in such case where should I collect all guessers hashes? I mean I should have some relation between hash and guessed number, something like: [hash] = guessedNumber;\nbecause on 100-th guess I should choose winner and transfer all the money to him and then start the game again :)\n", 1], ["2017-09-21 19:35:48", "aaand I just realized I can have something like this:\narray[counter] = {\n   sender: someHash,\n   guessedNumber: 123\n}\n\nso, I guess problem solved :) anyway, thanks for pointing to right direction :)", 1], ["2017-09-21 23:43:29", "yes that's what I meant. sorry for not spelling it out more clearly.", 2]]}, "94": {"created": "2017-09-19 04:54:38", "title": "What is 0x Project?", "num_comments": 0, "upvote_ratio": 0.8, "score": 3, "num_crossposts": 0, "comments": []}, "95": {"created": "2017-09-12 14:23:27", "title": "Need help spreading the word about your awesome project? Ethereum Jesus is here to help.", "num_comments": 13, "upvote_ratio": 0.55, "score": 1, "num_crossposts": 0, "comments": [["2017-09-13 05:46:39", "Help is always welcome www.zonafide.net . Feedback too.", 3], ["2017-09-13 01:40:16", "Yes, I'll take one marketing please for http://cillionaire.win. See also /r/cillionaire. Your rate is agreeable. Thanks!", 2], ["2017-09-13 22:15:39", "I should tell you about my [Macroverse project](https://macroverse.io), which is a procedurally-generated generated universe of star systems on the Ethereum blockchain. I'm still working on the planet orbit and terrain generation and so on, but the token sale I am running is ending soon, and I am worried that by the time I actually get to the really cool phases of the project, not enough unique people will have bought the tokens and my cool space universe will be empty of players. Marketing could help with that, and I'm not particularly good at it. ", 1], ["2017-09-29 12:40:00", "Would you still be open to helping out with marketing? \n\nMy team just released our alpha, a working proof of concept of a decentralized software development platform! It's called Project ONYX.\n\nHere's a [thread](https://www.reddit.com/r/ethereum/comments/735j0n/onyx_decentralized_software_development_alpha/) I posted with a link to the alpha and some more information in the comments. Honestly, we could use the help to get word out. Starting to touch base with the Austin Ethereum scene right now, but always good to get more assistance.", 1], ["2017-10-01 16:40:50", "I released [EscrowMyEther](http://escrowmyether.com/), a Dapp that facilitates transactions between 2 parties with escrow protection.\n\nAny help is appreciated. Thanks :)", 1], ["2017-10-04 00:54:51", "If you're interested in the project, I'd love your help at http://www.customizablebasicincome.com", 1], ["2017-09-13 06:20:09", "Interesting project, I really like that youre aiming to solve a big problem. Will ask questions in DM on Twitter. ", 1], ["2017-09-13 22:19:34", "I like this, but I'm not entirely sure what an \"activity\" is from reading your site. Is it an instruction? Or something you do by declaring to have done it? Can going to the store to buy milk be an activity?", 1], ["2017-09-13 01:56:24", "Thanks, I'll look into it. ", 2], ["2017-09-14 05:51:05", "Jesus is no good here. I dont really get this, might be bcuz Im not a game developer. Good luck! ", 1], ["2017-09-13 20:57:03", "I will watch out on twitter then.", 1], ["2017-09-14 03:42:10", "An activity is analogous to an instruction yes. If you wanted to make sure someone did not sell milk to someone pretending to be then yes buying milk could be an activity. \n\nThe actual instruction details are not in the Activity but the activity proves the instruction is as you defined and is yours.", 2], ["2017-09-13 01:58:35", "awesome, thanks!", 1]]}, "96": {"created": "2017-09-06 18:08:16", "title": "ETHLend: Decentralized lending and borrowing in crypto", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "97": {"created": "2017-08-31 17:31:41", "title": "What is Enigma Catalyst", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "98": {"created": "2017-08-30 03:51:58", "title": "What is Rivetz", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "99": {"created": "2017-08-28 20:47:29", "title": "Lunyr joins the Enterprise Ethereum Alliance (EEA)", "num_comments": 1, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": [["2017-08-30 04:47:10", "Congratulations", 1]]}, "100": {"created": "2017-08-28 06:51:11", "title": "Cryptoraffle - A new decentralised raffle on Ethereum with an uncapped prize pool and 3 winners on every draw", "num_comments": 7, "upvote_ratio": 0.72, "score": 3, "num_crossposts": 0, "comments": [["2017-08-28 18:44:46", "Is there an ETA for the launch? looks nice though...", 2], ["2017-08-28 16:06:38", "The site shows a certifcate error. Not going there, sorry.", 1], ["2017-08-28 19:39:48", "We are aiming to launch some time in September! Follow us on Facebook or Twitter for updates!", 2], ["2017-08-28 19:30:11", "Thanks for pointing it out! We had a minor configuration issue with our hosting provider but it's now sorted out!", 1], ["2017-08-28 21:37:40", "nice site. care to share any details on how you achieve randomness?", 1], ["2017-08-29 01:53:47", "In a nutshell, we use Oraclize and random.org to provide us with true randomness. We did a lot of research and decided that this would be the best and safest way to generate random numbers.", 1], ["2017-08-29 02:03:12", "I see, thanks. I agree it is a probably safe way, but you have to trust Oraclize. I think a solution that doesn't depend on a third party would be preferable, because one of the main selling points  of smart contracts - at least for me - is that they are trustless. \nThat being said, I do think Oraclize is a solid choice.", 2]]}, "101": {"created": "2017-08-25 20:57:02", "title": "Lunyr Writer's Block(chain) Competition with $10,000 Prize Pool", "num_comments": 1, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2017-08-26 14:38:54", "I got this announcement by email today. \n\nIt's a smart tactic to get a lot of free content generated for their platform, but I think only offering 3 large prizes instead of several more smaller ones makes it seem like the odds of winning are low. There also wasn't much guidance or reference material on what a winning article might be like. \n\nI won't be participating, but still think this is an interesting project to keep an eye on.", 2]]}, "102": {"created": "2017-08-18 18:29:23", "title": "Visual Summary of Cindicator", "num_comments": 0, "upvote_ratio": 0.8, "score": 3, "num_crossposts": 0, "comments": []}, "103": {"created": "2017-08-11 09:13:52", "title": "Planet of DApps: different ways to innovate on blockchain, systematized", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "104": {"created": "2017-07-28 16:41:32", "title": "Introducing EverMarkets -- Trading stock, bond, and commodity futures on the blockchain", "num_comments": 0, "upvote_ratio": 0.71, "score": 3, "num_crossposts": 0, "comments": []}, "105": {"created": "2017-07-04 02:39:53", "title": "42Wallet - Open source client side Ethereum HD wallet. https://42wallet.com/", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "106": {"created": "2017-06-13 20:45:58", "title": "Announcing Connext", "num_comments": 2, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": [["2017-06-15 03:42:09", "Do you provide documentation for the reference implementation of penguin dance?", 1], ["2017-06-15 04:59:45", "Unfortunately not, but [here's](http://emojis.slackmojis.com/emojis/images/1466660842/557/dancing_penguin.gif?1466660842) a great example!", 2]]}, "107": {"created": "2017-06-10 06:43:04", "title": "A preview of the front end for the Qchain advertising blockchain DApp", "num_comments": 0, "upvote_ratio": 0.68, "score": 3, "num_crossposts": 0, "comments": []}, "108": {"created": "2017-04-03 00:22:03", "title": "ethwordchain.com - A word building game on Ethereum.", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "109": {"created": "2016-12-29 21:52:18", "title": "The Ethereum Lottery Dapp", "num_comments": 0, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": []}, "110": {"created": "2016-08-21 13:55:37", "title": "BVRio started to use Regis (Consensys) in production", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "111": {"created": "2016-08-04 13:11:01", "title": "TheGrid - a new game DApp played on a grid - looking for feedback", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "112": {"created": "2016-04-06 13:10:29", "title": "LittleCactus", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "113": {"created": "2016-02-27 18:55:43", "title": "The three link flair options", "num_comments": 0, "upvote_ratio": 0.8, "score": 3, "num_crossposts": 0, "comments": []}, "114": {"created": "2015-08-10 20:54:40", "title": "Lotteresque", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "115": {"created": "2015-08-10 20:52:41", "title": "10 Eth Pyramid", "num_comments": 0, "upvote_ratio": 0.56, "score": 1, "num_crossposts": 0, "comments": []}, "116": {"created": "2015-08-10 20:52:13", "title": "0.1 Eth Pyramid", "num_comments": 0, "upvote_ratio": 0.81, "score": 3, "num_crossposts": 0, "comments": []}, "117": {"created": "2015-08-10 20:51:03", "title": "Top Sci-Fi movies", "num_comments": 0, "upvote_ratio": 1.0, "score": 3, "num_crossposts": 0, "comments": []}, "118": {"created": "2018-04-24 16:20:24", "title": "I interviewed the founder of trust wallet, The dapp browser.", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "119": {"created": "2018-04-22 15:16:24", "title": "CryptoGems.co Dapp", "num_comments": 2, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2018-04-23 00:33:45", "So, it's like having slaves mining for you? hahaha \nProbably, i'll get some.", 1], ["2018-04-23 00:36:09", "Well, my purpose is not to promote slavery, for sure. Hope you like it and share some feedback!", 1]]}, "120": {"created": "2018-04-22 10:37:50", "title": "First Look Video at upcoming Crypto Games Conferences From DApps Perspective", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "121": {"created": "2018-04-20 23:36:50", "title": "1 You should have the power to hold your cryptocurrency exchange accountable.", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "122": {"created": "2018-04-19 11:51:20", "title": "Video explaining robot economy", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "123": {"created": "2018-04-18 17:20:18", "title": "CryptoPurr.co", "num_comments": 2, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2018-04-21 21:44:19", "Glad to see additional projects being built on top!", 1], ["2018-04-23 00:44:01", "Nice to see apps built with REACT!", 1]]}, "124": {"created": "2018-04-13 01:27:50", "title": "ethermusic.io, a music creation Dapp. All funds raised go to the Ethereum Foundation Tip Jar", "num_comments": 0, "upvote_ratio": 0.76, "score": 2, "num_crossposts": 0, "comments": []}, "125": {"created": "2018-04-13 00:58:01", "title": "New video of CryptoFights just dropped", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "126": {"created": "2018-04-02 19:51:04", "title": "FreeSpeech.ForSale - Ethereum dApp Free Speech Billboard", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "127": {"created": "2018-04-01 02:42:16", "title": "Remote Distributed Mining", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "128": {"created": "2018-03-30 16:18:07", "title": "Smart Contract barriers....", "num_comments": 1, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2018-03-31 02:17:37", "You should look into the efforts being made with rent on contracts as well as a potential marketplace of crypto resources.  The team working on Ethereum are currently looking into what resources users, developers, and contracts use and how to create a fair market for them.\n\nCurrently contract development is about working within our limits to understand what we can do and how.  Definitely makes you think though!", 1]]}, "129": {"created": "2018-03-23 21:01:42", "title": "Upcoming Radex API", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "130": {"created": "2018-03-18 17:47:45", "title": "CryptoSoccr.com - Be the only owner around the world of a football player.", "num_comments": 30, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2018-03-19 02:07:31", "Hello /u/Chugwig, thanks for your answer. \n\nWe take care of your comments.\n\nThis is for me a beautiful part of the blockchain; everybody can do the same because the smart contract code is open source, now the only way to stay on the scene is to have the most fabulous app between all the copy. New challenge means new opportunity, and we trust that we can do one of the better apps for our users!\n\nCryptoSoccr Team", 2], ["2018-03-19 01:57:02", "DApps like this continue to have no purpose and little barrier to entry. People using your dApp are the only owners of football players until I or anyone else makes a second contract that does the same thing.\n\nIf it’s easy for you to take cryptocards or cryptobuildings and refactor a little bit, the same can be done with your code.\n\nNot totally knocking your program either, I get that a lot of time goes into making these apps but why not develop apps that are actually useful rather than following along with the trend of useless trading items that can be duplicated with 0 effort.\n\nThe first person to have sports players actually sign on something to be part of the contract will be the first person to have done all of these “buy sports players” ideas right. Anyone else is just making a desperate grab for cash.", 1], ["2018-03-19 02:24:20", "So since I can’t seem to find it anywhere (your site barely functions and somehow the info page can’t be viewed on mobile) what percent fee of each card purchase does your team take?", 1], ["2018-03-19 05:36:31", "Why do you fail half of the TXs?\nWhat's wrong with the frontend?\n", 1], ["2018-03-19 06:44:23", "Why is it that your terms page states that a 6% fee is taken but the team does not have access to it.  Taking a fee is fine, but lying about what you do with it is different.\n\n>The smart contract keeps a 6% commission fee on every transaction conducted through it, in addition to the Gas charged by the Ethereum network. The creators of this website and game do not have access or control over these fees, as it is handled directly on the distributed blockcahin network. \n\nBut if you read the contract there's a function that allows the ceo to make a withdrawal.\n\n\n    /// For paying out balance on contract\n    function _payout(address _to) private {\n        if (_to == address(0)) {\n            ceoAddress.transfer(this.balance);\n        } else {\n            _to.transfer(this.balance);\n        }\n    }", 1], ["2018-03-28 08:41:23", "We just deployed a new release on https://cryptosoccr.com. Almost 50 football players available, and new users everyday! Join us on our website and be the only owner of a player around the world on the blockchain! A huge release + surprise coming soon", 1], ["2018-03-31 07:22:12", "We just launched our BOUNTY PROGRAM https://medium.com/@CryptoSoccr/cryptosoccr-bounty-program-6de19d6f1010 on medium! Join us to be the only owner of a football player around the world!", 1], ["2018-03-19 02:25:56", "Not to highjack the thread but, if you're really into soccer and crypto but are tired of collectible dapps (as great as they are) and just want to bet some ETH on your favourite team via a decentralized smart contract, check out www.cryptosportz.com ", -1], ["2018-03-19 02:13:14", "Honestly have to give your team some mad credit for that response. I agree that it’s great that people can make their own things and the code is open source, I just believe in original work more than anything else.\n\nI wish you guys the best in your attempt to lead the market and hope that this is the end of the crypto_____ period of ethereum.", 1], ["2018-03-19 03:19:36", "I feel, without having the Rights from the players  or FIFA, the assets are not of any use. Same goes for any DApp dealing with sports/celebs/artists etc.\n\nA DApp with the Rights for the same will be much more successful and useful to play as you will own an official licensed asset. Otherwise it’s just waste of ether and the DApp makers get their cut for doing minimum efforts on the contract.\n\nSpecially, CryptoCelebs, is the biggest Ponzi scheme. They just tie the celeb name to an ERC721 and the UI does add the image and everything else. Tomorrow if any celebs raises a question they will switch over the image and from owning “A celeb” you will be owning nothing but just the name. \n\nPlay Responsibly!! ", 2], ["2018-03-19 06:14:42", "Thanks for your message, we are currently dealing with some awesome football players, stay tuned :) Lot of things are coming", 1], ["2018-03-19 06:16:03", "Unfortunately yes, because MetaMask is still not available on mobile, we decided to postpone it until the end of the beta, we will obviously resolve this problem in one of our next release.\n\nThe full payment process is explained on [https://cryptosoccr.com/terms](https://cryptosoccr.com/terms)", 1], ["2018-03-19 06:27:15", "Thanks for your message,\n**Multiple reasons here:**\n- We have a security for our users in the smart contract to not buy again the football player smart contract if they are already the owner.\n- To avoid spending to much ETH in gas, we decided to manually set the gasLimit to 120000 and the gas price to 5 Gwei.\nBecause the network is currently busy, our users received the classic message from metamask *'Transaction was not mined within 50 blocks'* and they tried again.\nFinally the network decide to take care of all the transactions but only the first one is processed (the rest of the transactions for this football player are obviously refunded).\n\nIf you have any advice for us to avoid these type of problems, don't hesitate to send it here! We will take care of every messages.", 1], ["2018-03-19 07:21:00", "The fees are taken in the following code:\n\n    // Update prices\n    if (sellingPrice < firstStepLimit) {\n        // first stage\n        playerIndexToPrice[_tokenId] = SafeMath.div(SafeMath.mul(sellingPrice, firstStepMultiplier), 94);\n    } else if (sellingPrice < secondStepLimit) {\n        // second stage\n        playerIndexToPrice[_tokenId] = SafeMath.div(SafeMath.mul(sellingPrice, secondStepMultiplier), 94);\n    } else {\n        // third stage\n        playerIndexToPrice[_tokenId] = SafeMath.div(SafeMath.mul(sellingPrice, thirdStepMultiplier), 94);\n    }\n\nBecause I don't want to tell you something wrong about this smart contract, I will check with our lead developer and give you the answer as soon as possible", 0], ["2018-03-19 06:17:14", "Thanks for this message, we are happy to find some other great tools around the sport (and mostly football). /u/cryptosportz do you accept to be contacted in private by one of our team?", 1], ["2018-03-19 03:29:26", "Exactly. If the asset your selling has no value anyone can reproduce it.  Disappointing but hopefully it’s just practice for better things. Ethereum needs to escape this Ponzi scheme mentality.", 1], ["2018-03-19 06:13:13", "Thanks for your message, we are in Beta and trying to improve our website every day, we are currently contacting many players to enhance your confidence in our crypto marketplace", 1], ["2018-03-19 06:30:37", "Yeah I saw that the players could choose to interact with the contract and take a percentage of the profits.  It's an interesting take I wish you luck.", 1], ["2018-03-19 06:32:34", "Please look into infura.io so that you're website is still mobile capable because anything else is pathetic in the 21st century.  Just because a site involves blockchain tech doesn't mean we should drop our standards of quality.\n\nAnd even if you'd rather not use infura (which metamask is already using) it's a joke that you require metamask for the page that gives information to users.  If I was considering using your application and someone told me to look up the site I would have to go to my computer just to learn about it.  Requiring metamask for use is one thing, but not learning about the product without metamask is just poor advertisement / user experience.", 1], ["2018-03-19 06:43:07", ">  a security for our users in the smart contract to not buy again the football player smart contract if they are already the owner. - To avoid spending to much ETH in gas, we decided to manually set the gasLimit to 120000 and the gas price to 5 Gwei. Because the network is currently busy, our users received the classic message from metamask 'Transaction was not mined within 50 blocks' and they tried again. Finally the network decide to take care of all the transactions but only the first one is processed (the rest of the transactions for this football player are obviously refunded).\n> \n> If you have any advice for us to avoid these type of prob\n\nI assure you that is not the case\nThink that your UI is not up to date, so it shows old prices, so people try and send Txs\nand fail\nLet the users overpay and set their price", 1], ["2018-03-19 07:22:37", "I’ve already looked at your contract it’s why I pointed out that you say you can’t withdraw the fee but I posted code showing you can...\n\nThis all looks very unprofessional.", 1], ["2018-03-19 22:30:39", "We are happy to be in contact with you.\n\nYes, send us a private message please.", 1], ["2018-03-19 06:11:03", "Thanks for your message, this is the beginning of something stronger! Stay tuned!", 1], ["2018-03-19 06:41:45", "Thank you, we are taking consideration of your message, this is in our pipeline and we will do it as soon as possible!", 1], ["2018-03-28 08:44:25", "The website is now available on mobile (still have couple of responsive design bug in it, they will be fixed soon)", 1], ["2018-03-19 07:22:10", "Thanks for your feedback, I will check with our team and come back to you as soon as possible", 1], ["2018-03-20 06:01:17", "Hello, I've got an answer from our lead developer, he told me that is a common stuff on most of the ERC721 contracts.\nSome links for example:\n[https://etherscan.io/address/0xf441b73b0a196aa67d32aee230aab5e54eef4765#code](https://etherscan.io/address/0xf441b73b0a196aa67d32aee230aab5e54eef4765#code)\n[https://etherscan.io/address/0xB75BAb60770f91bdb2Eb40f2e3663A05aD2090Ca#code](https://etherscan.io/address/0xB75BAb60770f91bdb2Eb40f2e3663A05aD2090Ca#code)\n[https://etherscan.io/address/0x606a24Aa75860A817cb5f2db859158Ca4866EDAF#code](https://etherscan.io/address/0x606a24Aa75860A817cb5f2db859158Ca4866EDAF#code)\n[https://etherscan.io/address/0x606a24Aa75860A817cb5f2db859158Ca4866EDAF#code](https://etherscan.io/address/0x606a24Aa75860A817cb5f2db859158Ca4866EDAF#code)\n\nAnd also on the CryptoKitties contract (method withdrawBalance())\n\nThanks again for reporting it ", 1], ["2018-03-20 05:58:20", "A new version has been deployed and everything should be fine! Apologies during your browsing. Thanks again for reporting this issue", 1], ["2018-03-20 06:08:55", "“Common stuff” doesn’t exist in programming and especially not contract development. You do understand that it’s a common piece of code to see because developers want to be able to withdraw ethereum from the contract (usually for fees). You say on your website that your team doesn’t collect or control the fees and I just want to know why you’re putting out incorrect info or if you even knew it was incorrect.\n\nAnd do keep in mind other functions such as a function that sends any tokens held by the contract to someone is also a common practice. It’s used to collect any random (or intentional) tokens held by the contract as normal sending functions don’t work with tokens. ", 1], ["2018-03-28 08:43:21", "Because the contract is internally sending the benefits to the previous owner when someone snatched it, we only have the fees in our balance.", 0]]}, "131": {"created": "2018-03-15 20:49:25", "title": "Crypto Sportz is live for NCAA! Come enjoy the simplicity and security of a decentralized sports wagering platform.", "num_comments": 0, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": []}, "132": {"created": "2018-03-15 20:16:29", "title": "OpenSign launched - peer to peer agreements", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "133": {"created": "2018-03-15 11:05:09", "title": "Are we living in the era of cryptokitties or not?", "num_comments": 8, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2018-03-15 19:18:40", "Dapps that perform simple services will probably have the greatest appeal. Games will come and go, but are unlikely to go mainstream in any real way. ", 2], ["2018-03-15 19:44:09", "As dApps become more mature we’ll see new things coming out concerning Financial and business technology. Decentralizing ideas will be done via the blockchain as well (look at storj bat or gnt) but the actual meat of the program should always be off chain (or on a different sort of chain) with ethereum storing hashes or some other mechanism of identifying nothing has been tampered with.", 2], ["2018-03-15 19:42:14", "I feel games have no permanent purpose on the blockchain. Micro payments within them maybe. Storing certain sparse data for certain features maybe.  But a whole game to be good and not the current money grabs we have now requires a different platform for Ethereum.", 1], ["2018-03-15 22:05:30", "I think probably no. Because at the moment we have payments in most of the games. Why would not make it transparent?\nAlso, awesome that a process of the game can be independent of actions of the creator.", 1], ["2018-03-15 22:13:59", "I'm agreed. The main fields for dapps will be things related to business. \nGames will take a special place in dapps development.", 2], ["2018-03-15 22:05:54", "Sure, another platform is needed for games. ", 1], ["2018-03-15 22:06:58", "ENJ will be big for micro transaction and item redemption.  1st for games you want to bet on your skills.", 1]]}, "134": {"created": "2018-03-09 02:24:30", "title": "Community Ethereum Development Conference will be held in Toronto on May 3-5, 2018", "num_comments": 2, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2018-03-16 03:34:31", "Anywhere I can find more details? I'm in Toronto and work currently with a company in the Blockchain and ETH space", 1]]}, "135": {"created": "2018-03-05 00:48:08", "title": "First dApp ethermusic.io, sheet music creation through a smart contract", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "136": {"created": "2018-03-03 17:33:36", "title": "Auctus launches the first robo and human advisory platform for crypto and traditional assets on Ethereum testnet", "num_comments": 0, "upvote_ratio": 0.76, "score": 2, "num_crossposts": 0, "comments": []}, "137": {"created": "2018-03-01 22:59:09", "title": "iOlite Brings Blockchain to the Masses- looks like r/ethdapps will be even more flooded soon :)", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "138": {"created": "2018-03-01 22:43:21", "title": "FinneyVote, a forum for controversy", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "139": {"created": "2018-03-01 16:23:47", "title": "MyEtherCity - SimCity on Blockchain", "num_comments": 0, "upvote_ratio": 0.76, "score": 2, "num_crossposts": 0, "comments": []}, "140": {"created": "2018-02-22 19:08:52", "title": "I have a working solidity contract, how do I deploy it?", "num_comments": 3, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": [["2018-02-23 06:53:20", "do it on a test network first", 1], ["2018-02-24 13:06:29", "Assuming you already know how to do basic web dev.\n\nhttp://truffleframework.com/ is the easiest, and most polished way. But it's not easy, its actually probably harder than the solidity contracts.\n\nThe ecosystem is still very young and you will find errors. \n\nIf you don't want to take advantage of all the truffle stuff. You can compile the contract to it's ABI, and load that with https://github.com/ethereum/web3.js/ Which has an api for loading contracts. You might try the beta version of web3 1.0.0 if you are just starting now. The 1.0.0 api is much nicer, and easier to work with, but you will almost certainly run into bugs. Which you probably will with 0.2.x as well. \n\nMost of the issues so far, in my experience, have been around Events.\n\nCheck out the truffle gitter when you try truffle as well, they are quite helpful.", 1], ["2018-02-25 07:38:17", "If you haven't settled on a solution yet.  Maybe take a look at Meteor.  You can import web3 into your meteor project and working with the templates is pretty \"simple\" depending on your programming background.  Anyway, just a suggestion.", 1]]}, "141": {"created": "2018-02-18 02:00:26", "title": "Crypto Sportz: NBA All-Star Game Featured Now!", "num_comments": 0, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": []}, "142": {"created": "2018-02-17 21:59:52", "title": "ToTheMoon - Ethereum Numbers Game", "num_comments": 2, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2018-02-20 06:45:09", "This is a nicely done smart contract! Lots of pitfalls with a game like this, but it seems like you've covered everything. Just make sure to keep the resolver running, otherwise it's very easy to cheat ;).\n\nNice UI/design as well.", 3], ["2018-02-20 06:48:03", "Thanks a lot! Yes, resolver died twice I had to refund 3 bets already :).", 1]]}, "143": {"created": "2018-02-15 16:31:43", "title": "I am looking for Ethereum/Solidity/Smartcontracts/ERC20 Developers worldwide for a number of ambitious projects. Remote Contracts available.", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "144": {"created": "2018-02-10 07:52:27", "title": "Fairgrounds: An ecosystem for provably fair gambling", "num_comments": 1, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": [["2018-02-12 04:57:21", "Your whitepaper shows that an audit is complete. Where can I view the results of this audit?", 1]]}, "145": {"created": "2018-02-07 07:46:16", "title": "What is a good way to create a reward smart contract for a ERC-20 token?", "num_comments": 4, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 1, "comments": [["2018-02-07 20:22:49", "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_anonymouscryp] [What is a good way to create a reward smart contract for a ERC-20 token?](https://www.reddit.com/r/u_anonymouscryp/comments/7vvpm9/what_is_a_good_way_to_create_a_reward_smart/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", 1], ["2018-02-09 04:57:17", "check over here - dappnews.io/resources \n\nthey should have something there that will be able to explain this. \n\nMy knowledge isn't that vast aha so I rather give you a good resource tool. \n\nGood luck!", 1], ["2018-04-04 20:20:03", "The best way to create any contract is to use [MyWish](https://contracts.mywish.io/dashboard/create/?utm_source=com&utm_medium=redditV&utm_campaign=tc&utm_content=V0404bestway). Several clicks, no coding and even a baby can create a great smart contract", 1], ["2018-02-10 18:48:42", "> Thank you - I will check it out.\n\n", 1]]}, "146": {"created": "2018-02-04 22:20:30", "title": "Looking for a ETH Dev interested in a new SEC compliant crowdfunding project.", "num_comments": 6, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2018-02-08 12:01:47", "Do you have a website or whitepaper I can look into? I wouldn't mind joining along for equity, but I wouldn't be comfortable as the only dev on the team.", 1], ["2018-02-05 07:34:09", "You're.. offering equity? To the guy who's going to build your whole company?\n\nhttps://www.riskology.co/idea-guy/", 1], ["2018-02-10 12:03:17", "Hey check out r/venturecorp", 1], ["2018-02-05 07:53:39", "There is ALOT more to building a company than writing the code. We could also just pay someone to develop it, but we would prefer someone who is vested in it's success. ", 1], ["2018-02-05 23:47:48", "Actually come to think of it. Nobody likes \"I'm an ace who has all of the requisite skills and can totally do everything myself even though I can't guy\" either.", 0], ["2018-02-05 23:48:21", "We call that the \"Trump Effect\"", 0]]}, "147": {"created": "2018-02-04 16:27:06", "title": "Crypto Jingles - First ever music based game on Ethereum", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "148": {"created": "2018-02-04 16:00:02", "title": "The button", "num_comments": 2, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2018-02-05 00:10:38", "where is the site ?", 3], ["2018-02-05 13:14:48", "Link?", 2]]}, "149": {"created": "2018-02-02 19:46:27", "title": "We'd love to get community feedback on Crypto Sport'z: a non-ICO sports wagering platform!", "num_comments": 2, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": [["2018-02-03 10:43:32", "Your website redirects to a generic GoDaddy page. :*(", 1], ["2018-02-04 05:46:07", "Try now. Our beta is live and in full swing!", 1]]}, "150": {"created": "2018-01-24 13:51:04", "title": "SportCrypt - Peer-to-Peer Sportsbetting Live on the Mainnet.", "num_comments": 1, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2018-01-24 21:55:13", "Note that SportCrypt will not modify the opening spread unlike a traditional sportsbook, so adjust your bets accordingly if there are line movements.", 2]]}, "151": {"created": "2018-01-11 19:50:54", "title": "Would any experienced DAPP developers be interested in a unique project?", "num_comments": 0, "upvote_ratio": 0.62, "score": 2, "num_crossposts": 0, "comments": []}, "152": {"created": "2018-01-11 09:47:30", "title": "BlockMesh, a communications network that replaces telco and reward data usage with tokens", "num_comments": 2, "upvote_ratio": 0.76, "score": 2, "num_crossposts": 0, "comments": [["2018-01-14 01:09:01", "It already exists and has a growing community. http://altheamesh.com/ why not raise coin for that project and contribute Dev and time to that. Those countries need cheaper accessible smart phones not to mention access to fast cheap Internet gateways which are not censored by governments. Lots to solve. PS your site has problems being viewed on mobile. ", 1], ["2018-01-17 02:08:21", "Great question! We're actually holding a live AMA now: https://www.reddit.com/r/icocrypto/comments/7qu3tf/ama_blockmesh_a_costfree_communications_network/?st=JCHYAIB5&sh=35162a7f\nWould you mind joining so that larger community can take part in the discussion?", 1]]}, "153": {"created": "2017-12-23 00:22:25", "title": "Currency Crate - Monthly Crypto Subscription Project", "num_comments": 6, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 1, "comments": [["2018-01-15 18:15:43", "", 2], ["2018-01-15 21:46:47", "Our intention is to not make this service decentralized in any way at the moment. We are looking to help the majority of investors out there who don't want to or have the time to research various coins and understand how ED works whereas. Like your grandma who asks you what Bitcoin is :). Easiest analogy would be a \"Birch Box\" for crypto.", 1], ["2018-01-15 23:36:18", "Whoops, I had two tabs open and was responding to another thread/another app.  I love your idea btw.\n\n", 1], ["2018-01-16 10:58:29", "No worries, and thanks! It's just a simple project my friend and I are working on to force us to do more research on new tokens.", 1], ["2018-01-16 21:35:38", "Tell me more?  I've been harping on my friends and family for years to buy crypto, and only a few have because of the challenges with getting setup on an exchange / dealing with wallets / etc.\n\n\nI checked out [another company doing it](https://coinstarterbox.com/), but it honestly feels scammy and its affiliated company, coinstarter, didn't look good or trustworthy.\n\n\nAlso kind of wondering about distribution.  If you restrict to Ethereum, you could just air drop them monthly and give your users a web3.js interface with their account without having them install a web3 browser.\n\n\nIf you can be honest and transparent about what you're purchasing the coins for (e.g. ICO price or exchange price, or whatever) and the mark up for the subscription, I would--and I think a lot of people would--be fine if you were marking them up to 40% to 60% what you buy them for.\n\n\nYou could get some hardcore viral growth if you used something like [https://ether.cards/](ether cards) when they sign up. Send 1 card for their account, and then an extra 3 blank ones, whose public address you offer a 1st month half-off promo price (if you mark up 50%).\n\n\nIf you put together a ~6 month introduction to cryptocurrencies email campaign that introduces concepts slowly in addition to talking about the coins you're sending, it would probably be on the top of my Christmas present list ideas to send people.\n\n\nMonth 1: Bitcoin - It's History - Decentralization - Why It's Novel\nMonth 2: Wallets - Blocks - Nodes - Consensus - Proof of Work\nMonth 3: Ethereum - Smart Contracts - The DAO\nMonth 4: Blockchain Use Cases - Why They Are Exciting\nMonth 5: The Main Challenges - Block Times - Scaling - Regulation\nMonth 6: Survey of Dapps - New Chains Working to Solve\n\n\nStart that cycle for each new user, and reserve a coin that illustrates the theme for that intro month that you always send in the cycle for a new user.  You'll build trust and credibility on auto-pilot, and they will start to understand what the coins do and their purposes are (maybe think back after Month 6, and realize they understand why you chose a coin in Month 1 if it went over their head).\n\n\nThat knowledge transfer would be worth the price, regardless of what you send.  You can sell the \"We'll get your people on board with crypto for you by making it exciting and digestible.\" Sell that to people in already in crypto, and you'll probably be bigger than Birch Box in a year or two.", 3], ["2018-01-16 22:09:38", "You have our entire business plan laid out! For real though, these are all issues/ideas we've thought about and are in the middle of building and executing. A few comments:\n\n1) Coinstarterbox - Yup we came across this company during our initial research and tried signing up, pretty complicated UI once you register (IMO).\n\n2) Ether cards - My idea was to literally send a box with physical coins and just overlay the logos of the coins we are sending on top of the coins so it feels like you are getting actual currency. These cards are pretty cool, will definitely look into them.\n\n3) E-mail campaign - we've been just writing random posts on our [Medium blog](https://medium.com/currencycrate) but the topics have not been super focused. I like your idea of having a build up from month 1 to month 6.\n\nThanks for providing a thoughtful response.", 1]]}, "154": {"created": "2017-12-12 13:25:45", "title": "LiveEdu ICO - Building a PACMAN game", "num_comments": 0, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": []}, "155": {"created": "2017-12-11 23:55:49", "title": "Seedom - A charitable DAPP (that doesn't involve cat breeding)", "num_comments": 0, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": []}, "156": {"created": "2017-12-10 07:42:58", "title": "Dapp to recommend contacts and earn reward points which will convert to tokens - BFF", "num_comments": 2, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2017-12-13 03:55:17", "You don't provide a link", 2], ["2017-12-13 11:28:08", "Here's the link - https://itunes.apple.com/us/app/bff-best-friends-forever/id1317793365?mt=8\n\nwebsite - thebffapp.com", 3]]}, "157": {"created": "2017-11-30 17:21:43", "title": "Pushing Ethereum to the limits – We just put a poo on the blockchain…", "num_comments": 1, "upvote_ratio": 0.64, "score": 3, "num_crossposts": 0, "comments": [["2017-12-01 11:53:01", "I really love your idea, good luck for the future!", 2]]}, "158": {"created": "2017-11-22 15:24:05", "title": "Apparently AppCoins is ran by Aptoide - looks interesting for long term. Your take?", "num_comments": 1, "upvote_ratio": 0.62, "score": 2, "num_crossposts": 0, "comments": [["2017-11-22 23:32:50", "i watched the live q&a a while ago, team looks like they have the know how, but an mvp is still in the distance IMO. check out their live q&a: https://medium.com/@appcoins/live-q-a-1-video-highlights-podcast-and-transcript-2d60629e6aa1\ni invested the minimum on the presale just in case :P but lets see how it evolves when the main sale opens", 1]]}, "159": {"created": "2017-11-21 19:28:33", "title": "New dApp! GhostKat, with new ERC20 pirate cryptocurrency, Dubloonz (DBZ)!", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "160": {"created": "2017-11-09 23:19:58", "title": "Got a great idea for a dApp?", "num_comments": 5, "upvote_ratio": 0.63, "score": 3, "num_crossposts": 0, "comments": [["2017-11-10 18:38:35", "Doing it for 1 BTC really makes me doubt you competence. \n\nBased on the time/effort to make a secure dApp and the actual demand for them you're either:\n\n* Going to make absolutely no money\n* Going to deliver shitty products\n\n", 4], ["2017-11-22 02:35:13", "If you want any help with the community i can help you! ", 1], ["2017-11-23 19:22:43", "portfolio?", 1], ["2017-12-04 20:48:54", "Well, 1BTC was 5k when OP posted :)", 3], ["2017-11-11 04:21:38", "1 BTC is our starting price for basic smart contracts, which can increase based on project complexity. Considering that most sites begin pricing at exorbitantly high rates (usually 25 BTC or ~$180,000), we think our pricing is fairly reasonable.", 2]]}, "161": {"created": "2017-11-08 10:13:48", "title": "62500 Pixel multi-user canvas on the blockchain!", "num_comments": 2, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2017-11-09 06:36:40", "Ugh, I've been working on the exact same thing for a while now... Zzz\n\nCare to share your contract code? Is it based on the same concept as leeroy?", 1], ["2017-11-09 18:14:57", "Hey! So I'll be releasing all the code. I actually modified the code from here: https://github.com/COSI-Lab/place which is a Python implementation of /r/place that uses websockets and file stored bitmap. I swapped out the websockets & file store for a smart contract. \n\nAs the COSI-Lab place is under GPL I'll also be releasing my version under full GPL. Just going to clean it up then place it all on github.\n\nAlso what's leeroy?? ", 2]]}, "162": {"created": "2017-11-04 17:11:54", "title": "The first incremental game dApp", "num_comments": 0, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": []}, "163": {"created": "2017-10-27 15:00:53", "title": "Are you working on dApp? Don't forget about E2E test!", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "164": {"created": "2017-10-13 15:25:03", "title": "EtherFlip - A Dice Game with a Twist", "num_comments": 0, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": []}, "165": {"created": "2017-10-11 05:52:35", "title": "What is Wanchain?", "num_comments": 1, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2017-10-16 13:11:12", "fantastic", 1]]}, "166": {"created": "2017-09-22 20:23:21", "title": "Seeking teammates for virtual blockchain hackathon project(s). [BLOCK-CON]", "num_comments": 0, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": []}, "167": {"created": "2017-09-21 18:24:51", "title": "What is Grid+?", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "168": {"created": "2017-09-07 04:03:22", "title": "Foobet - football betting service based on Ethereum smart contracts.", "num_comments": 3, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2017-09-12 15:37:21", "I read the Rules. Why put a limit for bet at 2 hours before game? Isn't the whole process automated?", 2], ["2017-09-13 01:24:31", "EthereumJesus is here to write history. I Will take part in the first Sports Bet on the Ethereum platform  ever. Whos up for a CL game tmrw? ", 1], ["2017-09-14 01:18:10", "the lag before matches was set because there are lags in the Ethereum network and transaction with a bet may take some time", 2]]}, "169": {"created": "2017-08-30 15:03:58", "title": "Visual Summary of Indorse", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "170": {"created": "2017-08-11 04:26:05", "title": "Our new Dapp (a fully decentralized market for Ethereum tokens) is ready for beta testing", "num_comments": 3, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2017-08-11 12:59:59", "Update: We've done a little bit of testing in Mist, and it looks like its working there.\n\nParity is probably still the best experience if you have access to a Parity Ropsten node, but MetaMask and Mist are fine too. Just remember to switch to the Ropsten network (which can be tough in Mist).", 2], ["2017-08-16 07:39:54", "Nice. I just \"got a similar idea\" and started searching for it. However I believe this can be done for free without any intermediary token like etx and for trading across non erc20 tokens.", 1], ["2017-08-16 08:18:47", "Etx is not an intermediary token that you trade for other tokens, etc. It is just a token that lets the system know to process your trades without charging a fee for the service.\n\nI think adding support for non-ERC20 tokens in the future could make sense, but ERC20 is nice because it allows us to add many tokens at once with a common interface.", 1]]}, "171": {"created": "2017-08-08 20:18:11", "title": "Untangling the ICO mechanics: How characteristics of an ICO campaign determine its outcome", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "172": {"created": "2017-07-15 15:58:42", "title": "Ethereum Unique Bid TestNet Release", "num_comments": 1, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2017-07-25 04:06:29", "What will you be using this smart contract to do?", 1]]}, "173": {"created": "2017-07-13 10:29:21", "title": "A new trying on Ethereum - ETTA Games", "num_comments": 0, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": []}, "174": {"created": "2017-07-10 20:30:13", "title": "Initial Pixel Offering: An Ethereum based marketplace to buy, sell, or trade digital real estate.", "num_comments": 0, "upvote_ratio": 0.66, "score": 2, "num_crossposts": 0, "comments": []}, "175": {"created": "2017-03-18 13:39:20", "title": "App for taking ethereum payments on Shopify", "num_comments": 6, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2017-03-19 04:08:34", "Hi Andyconlon. Great to hear you want to accept Ether. I'm developing an Ethereum application for splitting off part of a payment to make a donation to public services of the buyer's choice, in order for the seller to attract custom. If you'd like to use that, I'll look into making it work with Shopify for you. Or would you like to help?", 1], ["2017-04-05 21:29:14", "Interested. Please contact when ready.", 1], ["2017-06-09 12:43:29", "Can you accept ether using pay with coinbase or something? ", 1], ["2017-07-15 02:15:07", "Are you still working on this? I am interested.", 1], ["2017-08-11 03:32:01", "Hi. Yes I am. Are you interested in making it or using it or both?", 1], ["2017-08-12 20:14:58", "I'm interested in using it, but could possibly invest in development as well.", 1]]}, "176": {"created": "2016-08-06 15:43:41", "title": "Ethereum Blockchain Server RPC for rent for Web3.js CORS calls", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "177": {"created": "2016-07-28 03:54:01", "title": "How can I find an idea for a dapp? As someone with CTO experience doing enterprise eCommerce software, I can't think of a use case.", "num_comments": 3, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2016-07-28 19:53:57", "Look through the range of financial services that people buy and sell today. Things like escrow, notaries, counterparties, brokerages, options and derivatives, insurance, et cetera will all be rebuilt in parallel before anyone switches off their 1970s mainframes. Lots of time to duplicate an existing service but with trust and low costs. ", 1], ["2016-07-29 00:28:31", "I don't see how ethereum would have economic advantages in existing financial areas. What can I do with ethereum that I cannot do with normal mainframe servers?", 1], ["2016-07-29 01:04:21", "What can you do with a smart grid that you can't do with a normal electrical grid? It's a good analogy, because Ethereum is really about financial services infrastructure, and in infrastructure (real or digital) you have to build new systems alongside the old - it is not quick or exciting. Andreas Antonopolous has a good talk on YouTube about this phenomenon, which he calls Infrastructure Inversion. https://youtu.be/5ca70mCCf2M", 1]]}, "178": {"created": "2016-06-19 10:55:50", "title": "Our Experience Launching An Ethereum Dapp", "num_comments": 0, "upvote_ratio": 0.62, "score": 2, "num_crossposts": 0, "comments": []}, "179": {"created": "2016-04-14 20:34:28", "title": "Last is me! Time based, trustless lottery! Big Jackpot!", "num_comments": 0, "upvote_ratio": 0.63, "score": 2, "num_crossposts": 0, "comments": []}, "180": {"created": "2016-04-07 12:05:07", "title": "Highlander !", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "181": {"created": "2016-03-31 14:23:13", "title": "www.etherlist.top - randomized ponzi scheme with multiple payouts", "num_comments": 2, "upvote_ratio": 0.67, "score": 2, "num_crossposts": 0, "comments": [["2016-04-01 00:35:13", "Where's the source?", 2], ["2016-04-03 18:49:50", "For some reason I was not able to upload it to etherchain , therefore I uploaded it to etherscan.io\n\nYou can check www.etherlist.top or this link https://etherscan.io/address/0x66342e803943929dC47BcA1D625f42c7C725B049#code", 1]]}, "182": {"created": "2016-03-03 13:29:34", "title": "A simple scheme.", "num_comments": 1, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": [["2016-03-03 21:45:30", "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/dapps] [A simple scheme.](https://np.reddit.com/r/dapps/comments/48s0ot/a_simple_scheme/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", 1]]}, "183": {"created": "2016-02-24 17:47:17", "title": "Improved Doubler/Tripler Verified Contract", "num_comments": 1, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "184": {"created": "2015-08-13 03:14:11", "title": "Find Low sha3 Game", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "185": {"created": "2015-08-11 15:23:39", "title": "Roulette", "num_comments": 0, "upvote_ratio": 1.0, "score": 2, "num_crossposts": 0, "comments": []}, "186": {"created": "2015-08-11 00:02:13", "title": "Lottery/RNG Example", "num_comments": 1, "upvote_ratio": 0.75, "score": 2, "num_crossposts": 0, "comments": [["2015-08-11 08:35:43", "Please add the address to the first line! Thanks! You can also add it to the wiki if you'd like. ", 1]]}, "187": {"created": "2018-05-05 11:54:10", "title": "3 days left to stake on the winner of Eurovision 2018!", "num_comments": 0, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": []}, "188": {"created": "2018-04-30 18:41:07", "title": "CryptoCup - HODL Teams and earn income through virtual matches!", "num_comments": 0, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": []}, "189": {"created": "2018-04-21 23:20:41", "title": "Acey Deucey dapp (beta)", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "190": {"created": "2018-04-15 19:10:36", "title": "Saturn Network using a dApp to take trustless investment :)", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "191": {"created": "2018-04-14 21:01:25", "title": "CryptoKeywords: A Real-World Use Case for Ethereum’s ERC721 Standard", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "192": {"created": "2018-04-13 21:59:46", "title": "CryptoFights Beta is now live on Rinkeby.", "num_comments": 3, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2018-04-21 22:05:56", "Been waiting awhile for this!! Great article", 1], ["2018-04-22 04:13:35", "Yeah this game I am most excited about!", 1], ["2018-04-23 00:23:19", "I am amazed by these kind of dapps. Its like I want to be part of them all.", 1]]}, "193": {"created": "2018-04-12 14:42:45", "title": "Buda vs Pest - the most Ridiculous Rock-Scissor-Paper dual on Ethereum~", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "194": {"created": "2018-03-29 01:13:10", "title": "Saturn Network site is up now! So excited for this one bois!", "num_comments": 1, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2018-03-30 04:08:19", "Thanks for the support you can find us on /r/saturnnetwork", 2]]}, "195": {"created": "2018-03-28 11:58:36", "title": "CryptoElements - Ethereum dApp.", "num_comments": 7, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": [["2018-03-29 09:42:20", "Just another quickly copied ethereum dApp.  Not even that unique, I’ve seen this idea before and it was also posted less than a month ago.\n\nhttps://www.reddit.com/r/BlockchainGame/comments/80lpbb/brand_new_blockchaingame_cryptoelement_is_release/?st=JFBUSI1B&sh=1efb8fc9", 2], ["2018-03-29 14:45:56", "cool.\nDon't forget to submit it to dapp insight (https://dappinsight.com)", 2], ["2018-04-04 20:27:37", "Fuck that shitty app! The best what was made on the Ethereum basis is [MyWish platform](https://contracts.mywish.io/dashboard/create/?utm_source=com&utm_medium=redditV&utm_campaign=tc&utm_content=V0404bestmade) that allows anyone make smart contract without coding.", 1], ["2018-03-29 16:18:16", "Hi, www.cryptoelement.world for me isn't loading. But as I see from webarchive or twitter of this dapp they don't have system consisting of Scientist or Periodic Table Card, which gives you, as an owner fees. \n\nI am in crypto since January and wanted to give my brick anyway, so I scanned through dappradar.com before making ideas about dapp and didn't see that there, so I thought it will be more unique :D. I will try to make bigger post about some functionalities.\n\nCheeers!", 1], ["2018-03-29 16:15:21", "Thanks, I did, here is link: https://dappinsight.com/dapp/850/cryptoelements", 1], ["2018-03-29 16:41:26", "Interesting, my apologies for the quick decision. I still believe this style of DApp has been ran into the ground and is only hurting ethereum overall, but I can’t knock hard work.\n\nCongrats on the release, and maybe I’ll actually participate in this pyramid DApp.", 1], ["2018-03-29 17:35:09", "No worries, thanks fo honest opinion.\n\nOne of funcionalities, which is added, to compensate disadvantages of such pyramid dApps is that owner of any card can modify it's price as long as it is lower than current price and higher than starting price.", 2]]}, "196": {"created": "2018-03-26 03:10:30", "title": "Need community advice to decide which project to go ahead!", "num_comments": 2, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2018-03-27 00:40:07", "1 - Unless you have an in on a company that needs supply chain management and/or financing, then you're unlikely to succeed in this. Just a reality of how businesses operate. \n\n2 - A game is interesting. It's fun, and lots of people want to have a way to interact with the blockchain that is fun. But, you generally need some kind of financial incentive. Eg, tournament play, with increasingly better prizes based on rank, and a good buy-in. \n\n3 - Mining farms aren't terribly viable at the moment, which is scaring a lot of people off. That's good, because the difficulty curve will be more shallow, and allow you to mine in peace before the next big bump. It's bad if you are seeking investment in mining tho, as only the visionaries or highly risk taking folks will see the potential.  ", 3], ["2018-03-27 01:04:31", "Points taken! Momentum is shifting towards the game a lot!", 1]]}, "197": {"created": "2018-03-25 00:36:22", "title": "New domain has just launched for the Campaign Contribution DApp, check it out!", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "198": {"created": "2018-03-21 22:53:13", "title": "Huge Blockchain Event in California", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "199": {"created": "2018-03-21 12:23:52", "title": "VipCoin – Buy Vanity Bitcoin Address Trustless (also mining allowed)", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "200": {"created": "2018-03-20 05:07:04", "title": "I created the r/ethtuts subreddit for anyone who'd like to learn how to develop decentralized apps on the ethereum blockchain.", "num_comments": 2, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2018-03-20 15:39:54", "Why not just use r/ethdev ?", 1], ["2018-03-20 15:44:21", "I wanted a place that just has tutorials and reviews on tutorials. ethdev has a lot of stuff like general articles, other learning resources, updates on tools, etc. I just wanted a repository of tutorials so I can build a learning roadmap. ", 1]]}, "201": {"created": "2018-03-20 04:46:26", "title": "365icos.com beta testers wanted", "num_comments": 4, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2018-03-20 12:56:07", "If you have MetaMask installed and don't have a twitter account, reply and PM your wallet address for some free ETH to test out the site.", 1], ["2018-03-20 14:33:11", "I'm keen. Will PM details.", 1], ["2018-03-23 12:32:17", "Also any Toshi users out there, please DM for some free test ETH.", 1], ["2018-03-20 22:15:18", "ETH sent. Thanks!", 1]]}, "202": {"created": "2018-03-19 10:15:47", "title": "Ethergarden, the first virtual garden on the Ethereum blockchain", "num_comments": 0, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": []}, "203": {"created": "2018-03-13 13:59:17", "title": "Infect the World - Mutate viruses and infect people to earn ether!", "num_comments": 2, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": [["2018-03-15 16:49:29", "1. \"Once you withdraw your Ether, you have to wait 24 hours to withdraw again.\" If I have multiple viruses can I withdraw each every 24 or just one?\n\n2. If you mutate your own virus, gets your old one updated or do you hold both (parent and child)?", 1], ["2018-03-17 01:16:36", "1. you can withdraw each\n2. you hold both", 1]]}, "204": {"created": "2018-03-11 10:42:26", "title": "CryptoEmojis: An emojis game/marketplace", "num_comments": 4, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2018-03-12 01:21:50", "Interesting application although it’s definitely in the same bucket as the pyramid scheme ones. All you’re doing is creating another market for nothing with 0 value that will generate value due to the trading of that asset for more money.  Just because the base idea has changed and you can change the price, doesnt make it not crypto kitties.\n\nStill neat though and I’d love to see the contract code at some point. You say there’s no regulatory functions but you also collect a 4% fee. I find it hard to believe those go hand in hand as what if your account the payments are made to is hacked or lost. If there’s no regulatory functions on the contract you can’t change anything.", 1], ["2018-03-13 23:42:15", "Competation?", 1], ["2018-03-12 04:17:23", "Thanks for your input.\n\nYou can read the contract code, it's open source, the link is in the footer.\n\nYour argument that I'm creating something with 0 value can go into anything related to entertainment, specially gaming, Steam items as example.\n\nWe plan to add a game-play as I mentioned but we are a really small team and we want to gather some interest first and test the waters.\n\nAbout the hacking thing, welcome to the crypto world where justice and morality come from code.", 1], ["2018-03-12 04:31:15", "Eh the argument on 0 value is more about the fact that when I create a game or item within a game and sell it on steam it’s something that only I can create. Someone else would have to make their own game and then items that people are willing to buy within that game in order to compete with me.\n\nI could make a new version of cryptoemojis in an hour because the actual emojis are owned by neither of us, and my logic simply needs to differ from yours in a way that draws people away. For example, I could make it so that the first buyer of an emoji gets it for free but can only get 5 for free. Different model, same thing we’re selling but now you have a competitor that had to do little work to compete with you.\n\nAnd I have no idea what you’re talking about on hacking. Just because it’s crypto doesn’t mean it’s the Wild West.  Your contract is pretty well protected against someone getting your PK and messing with the actual contract, but they could at least steal all future profits from you. Have a way to change the owner on a contract may open up security holes but it also closes others and is a good idea on any owned contract such as this one.\n\nYou also don’t have a kill function so the space used by this contract (which it’ll probably use a decent bit) can never be freed back to the network.  Overall it looks secure though so if I was interested in participating I would do so confidently.", 1]]}, "205": {"created": "2018-03-08 06:26:58", "title": "SportCrypt - Peer-to-Peer Sportsbetting", "num_comments": 2, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": [["2018-03-13 23:43:47", "No offense, but this looks terrible. Really needs some UI work.\nAlso, how about an about page to get some background on how it works?", 2], ["2018-03-13 23:48:04", "Thanks man. I agree with all of your comments.\n\nMost of the time was spent on the smart contracts, and the UI is being worked on as we speak. ", 1]]}, "206": {"created": "2018-03-06 07:58:00", "title": "New game called CoinStacks is launched. 7 Ether has been given to players in just 3 days.", "num_comments": 6, "upvote_ratio": 0.56, "score": 1, "num_crossposts": 0, "comments": [["2018-03-08 09:24:24", "I like how NolemS is a brand new redditor, has 1 karma, and has only posted one thing...oh and it is about CoinStacks.  Nolem even says in the post \"take a look and join US\"?  Then the owner of the game acts like they don't even know who Nolem is??  I mean...really?  What a joke!!\n\nDapps are built on trust with smart contracts being visible having as much transparency as possible.  This is not a good start to gain the trust of users!!\n\nThanks for making all the Dapp developers out there look sketchy.  If we ever want the non-crypto world to join us and use our Dapps, this fake social media crap has got to stop!", 3], ["2018-03-06 18:01:08", "Thank you for posting this. I am the owner of this game. Glad to know that you like our game.", 1], ["2018-03-07 23:38:43", "It's crazy how simple of a \"game\" people can make and then people will spend money on. I didn't realize at first that you only get a payout the first time a coin is put on top of yours, otherwise this would be a jackpot for those willing to bet the .001 needed to start a stack. Interesting anyway. ", 0], ["2018-03-08 12:35:19", "I bet you have many karma, and your account must be so old.", -1], ["2018-03-07 23:39:00", "Creative but simple! Good job. Really like that background. ", 0], ["2018-03-08 00:25:09", "awesome! would you guys make more dapp games in the future?", 0]]}, "207": {"created": "2018-02-28 21:17:03", "title": "Crypto Sportz: MLS games now featured!", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "208": {"created": "2018-02-27 22:10:52", "title": "Using Multiple Accounts Via the same physical node for an Election", "num_comments": 5, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2018-02-28 23:45:13", "You can have as many accounts as you wish on the same node. With the geth javascript console or web3 from your app it is like this:\n\n    personal.newAccount() - Make a new account.\n    eth.accounts - Get an array of accounts.\n    personal.unlockAccount() - unlock account.\n    eth.defaultAccount - the account used for transactions.\n\nFor example, if you make some accounts with Personal.newAccount(), then do eth.accounts, you will get back an array of the accounts, you could unlock and use the first account with \n\n    eth.unlockAccount(eth.accounts[0]);\n    eth.defaultAccount = (eth.accounts[0]);\n\nThere are some slight differences between doing this with web3 and in geth, e.g personal.newAccount takes the password as a parameter in web3, but prompts you for it in the geth console.", 1], ["2018-03-01 00:18:16", "Thank you. I am trying to figure out the best way of getting 700+ people to vote, given that I can have no reasonable assurance that each person has a smartphone/other device that they can use as a node, or even has the foggiest clue what blockchain is. Is there a way to ensure that only one user uses each account? I was thinking that getting each of them to make a Metamask account might work (though that surely would be a bit of a crapshoot also), but I'm not 100% sure.", 1], ["2018-03-01 00:47:26", "Metamask isn't really designed for multiple users, I don't think it would work.\n\nIt might be easier to use a single account for sending transactions to the contract, and have the front end of your app sign a message using a private key you supply to each voter, with public keys stored in the contract. They wouldn't have to know what a private key is... just type it into the box. Pretty much your own accounts system.\n\nIf you want to hire me to make it for you, i'd be happy to oblige.", 1], ["2018-03-10 14:52:48", "Couldn't you give one token to each one and then make people vote with their tokens? At this point, if they give such token to another person, they're more or less saying they want to vote like this other person. ", 1], ["2018-03-01 02:36:02", "Thanks for the offer, but since this is meant to be part of a project for a College Dissertation, I'm pretty sure that would violate some rule or other, and I'll have to say no.", 1]]}, "209": {"created": "2018-02-27 05:52:06", "title": "Crypto Colors: a new Ethereum game that pays dividends", "num_comments": 1, "upvote_ratio": 0.6, "score": 1, "num_crossposts": 0, "comments": [["2018-03-01 01:57:55", "Seems like these games are being churned out rapid-fire. Is the SC development for these sort of cookie-cutter?", 1]]}, "210": {"created": "2018-02-26 23:12:29", "title": "Rare Bits announces they will refund gas fees for all auctions created on their marketplace", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "211": {"created": "2018-02-25 18:13:55", "title": "iOlite Aims to Facilitate Smart Contract Coding By Allowing Any Language via Its Fast Adoption Engine", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "212": {"created": "2018-02-24 13:41:56", "title": "Crypto Countries - World Domination On The Blockchain.", "num_comments": 0, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": []}, "213": {"created": "2018-02-23 00:28:01", "title": "Trying to put myself in a developers shoes.", "num_comments": 2, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2018-02-24 12:58:23", "Think of it this way:\n\nLets take javascript as an example:\n\nAlmost all programming languages have tons of features, that are, well, bad. And people recommend against using them. There are tons and tons of things in most programming languages you can do, but probably shouldn't. So you end up with things like this https://i.redd.it/h7nt4keyd7oy.jpg and it's not just JS, all languages have weird quirks and stupid features.\n\nWhat most people see in that image is a ton of extra stuff, and a ton of depth to js. What a blockchain developer should see when someone talks about using js as a blockchain language, is a small amount of \"good stuff\" and a huge surface area for compiler bugs, malicious libraries, confusing code, bad code, and endless application layer bugs.\n\nSolidity has relatively few features, and is very precise and explicit about everything. Which is good, when your talking about contracts that essentially can never be updated, and bugs can result in the loss of millions and millions of dollars.\n\nAlso, virtually all languages have support for floating point math, which is a problem for blockchain, because there are such things as floating point errors, which are hard to deal with and can be really hard to defensively program against. EG: https://gist.github.com/lsloan/f8c5ab552545ee968cca\n\nLooking at some projects, eg credits.com they claim they will support some prebuilt programming languages. IIRC it was going to be Java, or JS, which was the first thing that made me nope out (in addition to a bunch of other wildly ridicules claims, with no supporting evidence). Using a prebuilt language is not a feature, it's actually lazy, very lazy. Creating a new programming language is hard: The grammars are hard, the compiling is hard, optimization is hard, the AST traversal libraries are hard, the tooling is hard, the testing is hard, and the cost of mistakes is high. \n\nUsing a generic programming language which was not built with minimizing errors in mind: easy, lazy, and it's the end users who will pay for the laziness.\n", 1], ["2018-03-01 01:59:07", "A 14:1 capital:talent ratio might be a distinct advantage ;)", 1]]}, "214": {"created": "2018-02-21 22:45:34", "title": "Now Introducing EtherEstates: The Grandest Ethereum Collectibles Game!", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "215": {"created": "2018-02-21 03:29:18", "title": "Announcing the Wyvern Exchange: Any Ethereum asset, any ERC20 token, zero trust required", "num_comments": 0, "upvote_ratio": 0.57, "score": 1, "num_crossposts": 0, "comments": []}, "216": {"created": "2018-02-17 20:50:42", "title": "LMAO- Kim Jong-Un Collectibles", "num_comments": 1, "upvote_ratio": 0.57, "score": 1, "num_crossposts": 0, "comments": [["2018-02-21 22:23:54", "LOL This just had to happen.\n\nI'll make a share to help spread it! ;)", 2]]}, "217": {"created": "2018-02-13 22:41:42", "title": "CryptoCuddles: A CryptoKitties Battle Game!", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": []}, "218": {"created": "2018-02-10 15:40:17", "title": "VectorZilla - Selling Stock Photography On The Blockchain", "num_comments": 0, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": []}, "219": {"created": "2018-02-07 09:40:22", "title": "What is Sapien Network", "num_comments": 0, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": []}, "220": {"created": "2018-02-06 03:40:00", "title": "Nucleus Vision: IOT based contactless identification system", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "221": {"created": "2018-02-02 21:48:00", "title": "Rare Bits (Beta Launch) - A new marketplace where users can buy, sell and discover crypto assets", "num_comments": 0, "upvote_ratio": 0.66, "score": 1, "num_crossposts": 0, "comments": []}, "222": {"created": "2018-01-14 17:15:43", "title": "I'm building a trading card game - let me know what you think", "num_comments": 7, "upvote_ratio": 0.56, "score": 1, "num_crossposts": 1, "comments": [["2018-01-15 03:51:49", "Definitely read it as “My Thik Cards”. I think I need to cut down on the porn", 3], ["2018-01-15 01:35:01", "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/ethdev] [I'm building a trading card game - let me know what you think](https://www.reddit.com/r/ethdev/comments/7qd714/im_building_a_trading_card_game_let_me_know_what/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", 1], ["2018-01-15 10:51:57", "Will you implement trading cards?", 1], ["2018-01-15 18:04:52", "Are you going to add game mechanics, or is it purely collection?", 1], ["2018-01-15 03:54:58", "Should have called it Mythicc cards?", 5], ["2018-01-15 20:58:53", "Its implemented already", 2], ["2018-01-15 20:58:45", "Its going to have off chain battling", 1]]}, "223": {"created": "2018-01-11 11:33:14", "title": "The Ethereum Lottery", "num_comments": 2, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": [["2018-01-31 17:10:31", "You should show some basic information on your website when metamask is unavailable.", 1], ["2018-02-01 20:39:58", "We are showing different error messages depending on Metamask availability: Not installed, blocked, account not valid... But, as you are pointing, we should make them more clear and understandable for everyone.\n\nTx for the point!\n\nEdit: We have recently posted validated contract source code on Etherscan!", 1]]}, "224": {"created": "2018-01-10 20:45:05", "title": "Where should I incorporate a dapp company?", "num_comments": 4, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": [["2018-01-11 05:19:11", "Delaware ", 0], ["2018-01-21 02:42:37", "No, not Delaware. This is an misconception that is pushed around all over the internet. I bet Rezilient has no idea why they recommended Delaware, besides that they have hear others recommended. I would ask them, but I am sure they will just google it and try to act like they knew...\n\nThe reason Delaware is often recommended is because there are a lot of huge companies that are registered there. And that is because, they are the only state that has a completely different court system for corporations. So these mega corporations, like Amazon, Jpmorgan Chase, Bank of America, etc are based there because their tons of legal cases are addresses quickly and by judges that specialize in business law.\n\nI honestly would recommend starting you business in the state you live in. It is the easiest way to do it, and if done the road you start to get really big, then switching is not that hard. But I spend weeks researching when I created my company. And just realized its a big waste of time and that time would of been better spent building the actual business. Unless you have a lot of financial backing and have a ton of confidence that this business will work. Then just stick to your actual state.\n\nAlso, Rezilient, when someone asks for advice you should try to only give it if you are sufficiently informed, and/or have personal experience. ", 3], ["2018-01-14 01:12:40", "Nevada and Wyoming as well. Or open an offshore company. ", 1], ["2018-01-21 05:07:48", "Yes sir", 2]]}, "225": {"created": "2017-12-12 08:15:52", "title": "Per Annum - A token that can only be minted during the first two weeks of each new year.", "num_comments": 2, "upvote_ratio": 0.6, "score": 1, "num_crossposts": 0, "comments": [["2017-12-13 00:58:05", "This seems pretty cool.\n\nI guess what stops one person from mining all the coins for the year is contention for execution priority on the Ethereum chain?", 1], ["2017-12-13 07:19:47", "Yes, as long as there are others mining it, it should be fairly difficult for someone to mine all of the coins for that year.", 2]]}, "226": {"created": "2017-12-04 06:44:48", "title": "SafeOrDapp - SafeOrScam On The Blockchain", "num_comments": 2, "upvote_ratio": 0.6, "score": 1, "num_crossposts": 0, "comments": [["2017-12-05 01:21:37", "SafeOrDapp vs SafeOrScam compares Dpps with Scams, but you should use Dapp to describe safe applications.\n\nState of the Dapps sort of already does this, but not in a crowd-sourced way. My name suggestion is CrowdVerify if you are taking that route.", 3], ["2017-12-05 05:16:01", "Good point hadn't thought of that, I'll change the name :)", 1]]}, "227": {"created": "2017-11-22 09:48:06", "title": "Grafiti is the Crowd-Sourced Archive of the Internet", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "228": {"created": "2017-11-21 18:51:17", "title": "Appcoins tokens: Disrupting the Billion Dollar App Store Economy", "num_comments": 0, "upvote_ratio": 0.57, "score": 1, "num_crossposts": 0, "comments": []}, "229": {"created": "2017-11-20 18:01:24", "title": "Cross-Chain Bridges: Paving the Way to Internet of Blockchains", "num_comments": 0, "upvote_ratio": 0.6, "score": 1, "num_crossposts": 0, "comments": []}, "230": {"created": "2017-11-09 21:49:58", "title": "Bluzelle provides spooky update on dapp database", "num_comments": 0, "upvote_ratio": 0.6, "score": 1, "num_crossposts": 0, "comments": []}, "231": {"created": "2017-11-09 19:51:30", "title": "Supply Chain Escrow dApp", "num_comments": 0, "upvote_ratio": 0.6, "score": 1, "num_crossposts": 0, "comments": []}, "232": {"created": "2017-11-02 04:24:50", "title": "Oracles Network Ecosystem: Horizontal Scalability via Connected PoA Networks", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "233": {"created": "2017-10-27 17:20:19", "title": "Cryptibles - A DApp to create and collect ERC-20 based Digital Collectible. -NEED Feedback & Beta Testers :)", "num_comments": 2, "upvote_ratio": 0.53, "score": 1, "num_crossposts": 1, "comments": [["2017-10-28 02:08:56", "Have you looked at the emerging standards for non-fungible assets on Ethereum?", 1], ["2017-10-28 02:37:08", "> non-fungible assets on Ethereum\n\nYes, we have taken a look at a non-fungible approach, but our current implementation is similar to Curio Cards or Rare Pepe, where we have a collection of individual tokens with their own contracts. Tho, we are open to change this in the future if a non-fungible approach makes more sense. ", 2]]}, "234": {"created": "2017-10-27 11:04:54", "title": "a 4chan-like dapp, because we need one", "num_comments": 1, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": [["2017-10-29 19:05:01", "This looks amazing, well done", 1]]}, "235": {"created": "2017-10-25 09:08:34", "title": "Ethereum Dapp & More For Crowdfunded Loans", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "236": {"created": "2017-10-21 16:21:11", "title": "Thanks for introducing ETTA Dapp", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "237": {"created": "2017-09-15 06:53:51", "title": "We created a video to show what's our Dapp", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "238": {"created": "2017-09-14 19:25:33", "title": "What is ICOS", "num_comments": 0, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": []}, "239": {"created": "2017-09-12 03:12:47", "title": "What is Polkadot?", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "240": {"created": "2017-09-08 17:28:07", "title": "What is Filecoin", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "241": {"created": "2017-09-07 19:22:33", "title": "Cillionaire - What if thousands of people gave 0.01 ETH to one person?", "num_comments": 3, "upvote_ratio": 0.53, "score": 1, "num_crossposts": 0, "comments": [["2017-09-08 12:00:51", "Where is the smart contact? ", 2], ["2017-10-01 08:06:27", "What's to stop an agent from generating a massive amount of donations to control a majority of the beneficiary pool? Sure, they lose .003 Eth on every round per entry, but as long as the remainder of the pool that isn't them donates enough to cover the fee loss, you could maintain near control over the game in its current state. ", 1], ["2017-09-08 13:11:27", "The smart contract is here:   \nhttps://etherscan.io/address/0x663a5cA0295231B0d88afB1C557a8D8f4C1B6459\n\nThe source code is here:  \nhttps://github.com/cillionaire/cillionaire2\n\nThe frequently asked questions are here:  \nhttp://cillionaire.win/faq.html  \n\nAll of that information can also be found on the links provided in the post.\n\nEDIT:  \nAlso, we put out a bug bounty of 1 ETH which generated some valuable feedback [here](https://www.reddit.com/r/ethdev/comments/6y1ou0/cillionaire_bug_bounty_1_eth/).  \nThe previous version of the contract was [here](https://etherscan.io/address/0x02b97cca6d6a5227e464b2a60ee1a580ea4f7da9).\n", 3]]}, "242": {"created": "2017-08-30 06:27:18", "title": "ETTAGames.io - A Fun Decentralized Games", "num_comments": 4, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2017-12-27 01:38:18", "This is really cool congrats", 2], ["2017-09-01 22:25:48", "looks like it's down", 1], ["2017-09-04 08:51:18", "Hi clowns10\n\nThank you for informing us, we checked the service is working well, and we will check the log in past 2 days. Thank you so much again.\n\nETTA", 1], ["2017-12-27 10:05:07", "Thanks a lot. We are going to launch ETTA 2.0 next week, wish you can experience it!", 1]]}, "243": {"created": "2017-08-30 04:02:28", "title": "Golem Visual Summary", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "244": {"created": "2017-08-23 21:23:50", "title": "Brickblock visual summary", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "245": {"created": "2017-08-23 10:19:15", "title": "Ezether - Decentralized ether trading marketplace", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "246": {"created": "2017-08-18 19:03:55", "title": "Comparison of NUMERAI and Cindicator", "num_comments": 0, "upvote_ratio": 0.66, "score": 1, "num_crossposts": 0, "comments": []}, "247": {"created": "2017-08-18 13:53:01", "title": "Payment services to receive FIAT for crypto in DApp", "num_comments": 3, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2017-08-21 19:01:22", "So nobody knows any fiat to crypto payment providers that have an API to integrate into a DApp. Do coinbase?", 1], ["2017-08-29 18:20:05", "Ok, so in answering my own question I have Uphold and Coinbase so far ", 1], ["2017-08-30 21:35:15", "Not heard of Uphold, Coinbase is probably the best bet. Shapeshift also have API integration, it's on a lot of the multi coin SPV wallets but no FIAT on rails. Changelly have an API also. ", 2]]}, "248": {"created": "2017-08-15 07:17:31", "title": "Visual summary of STOX", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "249": {"created": "2017-08-13 19:48:08", "title": "MoonCatRescue - A Minable Blockchain Collectible", "num_comments": 1, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2017-08-18 09:48:17", "Love this!", 1]]}, "250": {"created": "2017-08-09 17:28:24", "title": "Omega One Visual Summary", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "251": {"created": "2017-08-08 00:17:16", "title": "ICO: Fundraising Anarchy or a New Trust Standard?", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "252": {"created": "2017-07-25 10:49:04", "title": "Introducing CCCoin - The Most Innovative and Socially Conscious Currency Ever!", "num_comments": 0, "upvote_ratio": 0.57, "score": 1, "num_crossposts": 0, "comments": []}, "253": {"created": "2017-07-10 19:56:57", "title": "Ethereum based asset market", "num_comments": 4, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2017-07-11 04:47:59", "Right now there's [EtherDelta](https://etherdelta.github.io/), which is a decentralized token trading platform.\n\nOne solution that some people have used to solve the potential front running issue is to deploy scripts that mask what calls are being made to the contract.", 1], ["2017-07-11 05:13:00", "That's cool, thanks! They don't do order matching but it's a start.", 1], ["2017-07-11 05:18:29", "Oh there's a couple of people running bots that will happily arb you if you make an arb-able order.\n\nSo in a way, kinda.", 1], ["2017-07-11 06:37:25", "Yeah but if there are hundreds of orders a minute then without order matching things get confusing.\n\nOrder matching may be too computationally intensive", 1]]}, "254": {"created": "2017-06-07 05:51:11", "title": "EthereumPot: An online ether gambling site", "num_comments": 1, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2017-07-05 18:09:50", "the site appears to be down", 1]]}, "255": {"created": "2016-05-19 09:29:09", "title": "Crypted RPS ; first secure rock paper scissors on ETH !", "num_comments": 0, "upvote_ratio": 0.6, "score": 1, "num_crossposts": 0, "comments": []}, "256": {"created": "2016-05-07 06:34:11", "title": "[GAME] Matching Ethers : Strategy and Luck Game", "num_comments": 0, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": []}, "257": {"created": "2016-04-24 20:10:35", "title": "12 Bagger", "num_comments": 1, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": [["2016-04-27 11:03:26", "play this game long enough and you will lose.", 1]]}, "258": {"created": "2016-04-18 18:30:24", "title": "The blockchain into the blockchain -- Game", "num_comments": 0, "upvote_ratio": 1.0, "score": 1, "num_crossposts": 0, "comments": []}, "259": {"created": "2016-04-07 18:16:43", "title": "Ethstick - A satirical, yet profitable ponzi game", "num_comments": 4, "upvote_ratio": 0.57, "score": 1, "num_crossposts": 0, "comments": [["2016-04-12 03:00:38", "Do you know what scalability means ? Seriously, its not hard to make a game that doesn't break after 50 users. Stop posting garbage. ", 0], ["2016-04-12 03:22:36", "Do you know math? 139 payouts executed, the next payout is always <=6ETH away. That's as scalable as it gets, smartass.", 0], ["2016-04-12 03:24:05", "I have a Minor in Math and did two years of Graduate Econometrics. Its not.", 1], ["2016-04-12 03:25:26", "When you figure out how to make it pay out to everyone after every transaction, let me know. ", 1]]}, "260": {"created": "2016-04-06 14:02:05", "title": "4X and 5X verified contracts", "num_comments": 1, "upvote_ratio": 0.67, "score": 1, "num_crossposts": 0, "comments": [["2016-04-08 04:57:59", "Go for a realistic one: x4 and x5 are totally unsaistainable\nThere are others: Diana (x1.8, reasonable), LittleCactus (x1.4 but faster)\nAnd even some fun ones like greedpit", 2]]}, "261": {"created": "2015-08-10 20:51:39", "title": "1 Eth Pyramid", "num_comments": 0, "upvote_ratio": 0.55, "score": 1, "num_crossposts": 0, "comments": []}, "262": {"created": "2018-05-04 11:44:18", "title": "REPOP WORLD is now Live on the Main Net", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": []}, "263": {"created": "2018-04-16 14:11:18", "title": "Who will be the great cryptoEmpirez?", "num_comments": 2, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-04-16 23:23:10", "Weird website, doesnt make much sense and very little explanation. Looks like a scam", 1], ["2018-04-16 23:31:54", "It's not a scam. it's just simple. read the \"How\" on the website.\n\nI'd appreciate you'd write what you understood in your own words, It would help understand what needs to be clarified \n\nAlso you could checkout the smart contract, there's a link at the footer of the website: https://etherscan.io/address/0xb5e0b11ecd4e033ebaf09399328b7f954bf34208", 1]]}, "264": {"created": "2018-03-26 15:50:19", "title": "HODL your Ether and ERC20 tokens in a Time Capsule!", "num_comments": 3, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-03-27 14:27:21", "Took a quick look at the code at https://www.ethcapsule.com/contract and found some minor issues. I've copied the code that I found at the above link to pastebin: https://pastebin.com/UYcZK6wP\n\n---\n---\n---\n\n**This is the biggest issue**\n\nI recommend that you add the check `require(_recipient != address(0))` in the constructor. Otherwise you could end up creating a capsule with no recipient by not passing any arguments to the constructor. Screencast: http://recordit.co/Wk1mfI3A5w\n\n--- \n\nThe compiler version being used is pretty old. I recommend using a newer version.\n\n---\n\nThere is no way to withdraw ERC20 tokens without draining ETH from the capsule.\n\n---\n\nIt is possible to create a capsule with excavation date in the past.\n\n---\n\nRemix raises 6 deprecation warnings on pasting this code. They should probably be fixed :)", 1], ["2018-04-04 20:36:44", "That's a total shit guys, forget about it. The beast platform for creating token contracts is [MyWish](https://contracts.mywish.io/dashboard/create/?utm_source=com&utm_medium=redditV&utm_campaign=sc&utm_content=V0404youreshit). Anyone can create smart contract  there with several clicks and no coding.", 1], ["2018-03-27 20:45:47", "Hey, thanks for checking out the code! We'll be sure to have these minor issues fixed in the next release :) \n\n*Edit* Re-read your comment and withdrawal functionality is working as intended, the idea is you would withdraw all your tokens and ether at once. The array of address is passed in for efficiency rather than having to keep a list of ERC20 tokens inside the capsule. It's possible to withdraw tokens one at a time, but there's really no reason to do so.", 1]]}, "265": {"created": "2018-03-24 09:23:36", "title": "I am looking for skilled solidity/smart contracts developers for a number of cool international clients, startups and corporates. Positions are remote and well paid. Reach out for more info! Thanks", "num_comments": 6, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-03-25 08:32:39", "It takes nearly no time to set up SSL on a web domain in today's time.  Please set it up as I can't take many sites seriously without it (especially those in the blockchain sub-group) and your site looks rather professional otherwise.", 2], ["2018-03-25 10:34:38", "Happy to hear, let’s encrypt will help you do it for free", 2], ["2018-03-28 03:50:46", "Site looks professional and useful. \n\nWhen I search in the find-a-job section, the text is white so I cannot see what I am typing", 2], ["2018-03-25 10:26:37", "Thanks for the tip, I will :) ", 2], ["2018-03-25 10:43:49", "Appreciate that. PM sent", 1], ["2018-03-28 13:46:42", "Thanks for the positive feedback and for the tip, will fix it", 1]]}, "266": {"created": "2018-03-23 17:33:10", "title": "CryptoLeaders : An Ethereum game to own & Trade historical figures", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 1, "comments": []}, "267": {"created": "2018-03-23 00:11:42", "title": "History of humanity in one smart contract", "num_comments": 3, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-03-23 08:18:16", "You have too much supply bud", 1], ["2018-03-23 08:48:20", "Any site with functionality to log in with your private key is pushing a product I will never trust. It’s the first rule of the blockchain, and overall this doesn’t even seem to relate to the title.\n\n[EDIT] having taken a further look at the website I am nearly 100% confident this is a scam. It’s no different from any other card ethereum contract that promises “game like features in the future”.", 1], ["2018-03-23 19:52:51", "Thanks for the feedback.\nIt's interesting to see how your dapp look to other people point of view.\nIt's TRUE that there is no proof, we will ever develop a new dapp that use this one with battle system.\nSo we will have to go further in development to be more trusted.\n\nThe no metamask part will be removed if it frightens people.", 2]]}, "268": {"created": "2018-03-16 10:29:27", "title": "9000 Cryptokitties Dapp-users got mysteriously airdropped 100 000 000 Avocado(AVO) Tokens!", "num_comments": 2, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-03-17 03:38:13", "Yeah! I got some 😊 will check it out ", 1], ["2018-04-04 20:39:11", "Wow, that's so great, I love that! You guys can also create something like that using [MyWish platform](https://contracts.mywish.io/dashboard/create/?utm_source=com&utm_medium=redditV&utm_campaign=sc&utm_content=V0404yourcan). It allows to create token contract fast, easy and with no coding!", 1]]}, "269": {"created": "2018-03-13 15:12:16", "title": "You like surprises? Check out Crypto Surprise!", "num_comments": 2, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-03-16 06:15:15", "all the bags looks identical...I have no idea which one I should buy", 1], ["2018-03-16 15:40:07", "Hi. well this is the difference eith other similar games = there the items to buy are different upfront. Here, you know nothing upfront. Its part of the mystety, buy a Surprise and see what you got. ", 1]]}, "270": {"created": "2018-03-01 01:28:46", "title": "CryptoFights.io — The Future of Gaming on the Blockchain", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": []}, "271": {"created": "2018-02-22 11:12:08", "title": "CryptoStamps come up with the first Bitcoin Stamp Visit: www.cryptostamps.co", "num_comments": 2, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-02-23 07:10:38", "Lots of crypokitties clones without a team of artists", 1], ["2018-02-23 12:48:11", "I bought their stamps because they've future vision. which cryptokitties and other clones don't have.", 1]]}, "272": {"created": "2018-02-14 01:27:09", "title": "A crowd owned/funded public corporation that is SEC compliant? Join the conversation!", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": []}, "273": {"created": "2018-02-07 02:49:21", "title": "BillionTix 4.5Million Ether Giveaway is Live!", "num_comments": 3, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-02-10 15:50:10", "Has anyone tried this?", 2], ["2018-02-14 16:01:48", "Ok, let's say you buy ten of the first 100 tickets... you have 10% chance that one of your tickets are selected and you get all your funds back on the first level. There are 8 more levels at 200, 300, 400 and so on to 900. Each time, you have 5%, then 3.33% and then even less to get your funds back. When adding every events, on average, you'll lose money. \n\nWhen buying a ticket beyond 1000, rinse and repeat with 10 times more expensive tickets and rewards. \n\nI may have missed something (in which case, please tell me), but I wouldn't try this lottery, unless feeling very lucky. ", 2], ["2018-02-15 13:35:13", "Yeah you totally missed it!  It's ok!   So there are 9 levels of giveaways.  Every 100..every 1,000... every 10,000...every 100,000..every 1,000,000...every 10,000,000...every 100,000,000...every 1,000,000,000...and at 10,000,000,000.  So each 100 BillionTix up to the Jackpot there is a giveaway.  \n\nSo 1 Billion drawings of the 100 level.  Same for the 1,000 giveaways...100Million giveaways of the 1,000 level.  For the 10,000 level there are 10 Million drawings.  For the 100,000 level giveaways, there are 1 Million of those....and just keep going until there is just one final mega giveaway that includes all BillionTix.\n\nWe run through some examples in the FAQ on our page.  So there is a giveaway at every hundred tickets sold during the entire game.  So you buy Billiontix 102, you have a 1/100 chance of winning the giveaway between tickets 100 and 200.  That same BillionTix...number 102 is then automatically entered and valid for tickets 1 thru 1,000...then 1 thru 10,000...then 1 thru 100,000...on up with increasing prizes each level.  You don't have to do anything but hold your ticket and hope you have good luck at each level.  Those are the prize levels.\n\nSo you buy BillionTix 1,567...you would be entered into the drawing of the 100 level of BillionTix 1,500 thru 1,600...then the next level of BillionTix 1,000 thru 2,000...then 1 thru 10,000...then 1 thru 100,000.  The payout for each level increases as the odds increase.\n\nSo what if you buy the very last BillionTix number 9,999,999,999?  You would be entered into the Giveaway between 9,999,999,900 and 10B..drawing 9,999,999,000 to 10B...Giveaway 9,999,990,000 to 10B...then 9,999,900,000 to 10B....etc all the way down to BillionTix 1 to 10B for the 500,000 Ether Jackpot.  \n\nSo even the very last ticket has the exact same chances as the first to win all of the prizes.\n\n\nHope this explains it better!  It is a cool concept and idea for a Giveaway that we hope people start to get.  I know we are new and this is a type of Giveaway never seen before!  For @ $0.50 a BillionTix right now, pick some up...they are pretty cheap while the market stays steady.\n\nTL;DR  One BillionTix is good at all levels and can win multiple prizes. \n The previous post was not correct about the Giveaway Levels.\n\nEven the very last ticket sold has the exact same chances as the first to win all of the available prizes.  The odds don't change and the payouts increase.  Read our FAQ at www.billiontix.com for more examples!  Or just read what we posted above. Sorry its long...its new!", 2]]}, "274": {"created": "2018-01-24 18:34:39", "title": "Trying to get started with developing dapps... How do I test it ? [more specific in text]", "num_comments": 1, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2018-01-27 04:46:14", "That seems to me a bit starting in the deep end.  I would start with a tutorial that walks you through the basics first.  To answer your question it sounds to me like you are not running the index.html on a web server just off your local drive and that will not work.  You need it hosted off a server or running on localhost.\n\nI found the Truffle tutorial easy to follow and works well.  I would start there. Then improve the contract to do what you want.\nhttp://truffleframework.com/tutorials/pet-shop\n", 1]]}, "275": {"created": "2018-01-22 08:56:36", "title": "Anybody trading CryptoCelebrities?", "num_comments": 7, "upvote_ratio": 0.44, "score": 0, "num_crossposts": 0, "comments": [["2018-01-23 10:02:26", "Is this another ponzi game?", 4], ["2018-01-23 03:41:17", "same basically", 1], ["2018-01-29 11:58:46", "Having trouble getting buying one. any advice?\nAs soon as a new celeb pops up i try to bid and cannot get them\nI've tried many many times to no avail. Ive tried over bidding and upping the gas fees also no luck. Could it be my internet and/or my computer is too slow? Any advice would be appreciated? thanks", 1], ["2018-02-20 02:14:17", "Can you still manage to hold your celebs and not being snatched away  by other people? The new feature has been added to the game which interest will be paid while bagholding. Any advice for celebs not being snatched from me?", 1], ["2018-01-27 14:43:29", "Yes.  A low effort, copycat ETH grab.", 3], ["2018-01-30 14:58:57", "I haven't bought one in a while, as the lowest prices seemed out of budget :P ... Have you had any luck since?", 1], ["2018-02-20 14:23:24", "That is a cool new feature... Are you playing to hold onto your celebs, or playing to make money? ", 1]]}, "276": {"created": "2017-12-23 04:24:27", "title": "I Gave Charitable DAO looking for more", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": []}, "277": {"created": "2017-09-05 20:33:57", "title": "Visual overview of CoinDash", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": []}, "278": {"created": "2017-09-04 20:14:03", "title": "What is CryptoPing?", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": []}, "279": {"created": "2016-04-30 20:54:48", "title": "Weekly 2% Ether Bonus", "num_comments": 3, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": [["2016-05-01 05:15:19", "Can't see any option to withdraw fund or any source code or abi.", 1], ["2016-05-02 22:02:30", "You can *withdraw your Ether + EtherBonus™ at any time by simply sending exactly .1 Ether to the contract. There is a 5% penalty ONLY if you withdraw your Ether within the first week. A .1 Ether transaction fee applies. as stated on the website.\n\nWe felt it was better let people experience the withdrawal process because not everyone can read the code.\n\nWe will offer up the source as soon as there is some traction so we have a first mover head start since the code is so easy to replicate. \n", 1], ["2016-05-05 15:57:09", "Do people actually fall for this bullshit?\n\nThis is bad, and you should feel bad.\n\n", 2]]}, "280": {"created": "2018-04-30 13:26:50", "title": "AIRDROP: Introducing Hedgie, the cryptocollectible that makes crypto coin. Grab your FREE Hedgie here, before the airdrop closes!", "num_comments": 0, "upvote_ratio": 0.33, "score": 0, "num_crossposts": 0, "comments": []}, "281": {"created": "2018-04-25 23:39:00", "title": "ERC20 HODL!", "num_comments": 0, "upvote_ratio": 0.33, "score": 0, "num_crossposts": 0, "comments": []}, "282": {"created": "2018-03-28 23:26:40", "title": "What would Be the Very First Step in creating a Dapp?", "num_comments": 3, "upvote_ratio": 0.33, "score": 0, "num_crossposts": 0, "comments": [["2018-03-29 20:37:38", "Hey, registering domain and getting host will be actually on last place. You cold work on tour dApp on localhost.\n\nThis link will help you for deploying first dapp:\nhttps://itnext.io/build-your-first-blockchain-application-in-5-quick-steps-89ebb96adbfe", 2], ["2018-04-02 22:16:34", "you can also check out this great resource - https://www.dappnews.io/resources \n\nHas a ton of stuff to get your started ", 1], ["2018-03-30 00:20:48", "Thank you, I’ll check it out :)", 1]]}, "283": {"created": "2018-02-01 03:13:21", "title": "Tulips On The Blockchain! EtherTulips Gen 1 Is Out. Prices Increase 50% Everyday.", "num_comments": 0, "upvote_ratio": 0.5, "score": 0, "num_crossposts": 0, "comments": []}, "284": {"created": "2017-11-24 18:17:44", "title": "How can Blockchain help develop emerging markets?", "num_comments": 1, "upvote_ratio": 0.44, "score": 0, "num_crossposts": 0, "comments": [["2017-11-25 15:32:39", "\n[Bloom](https://hellobloom.io?mwr=6025-46f1d677) is trying to make credit scoring more accessible to people, which is good for emerging markets. Team is Stanford computer scientists at least one with a Thiels Fellowship, one Forbes 30 under 30, and multiple who have sold companies to huge corporations... and the whitelist signups end tomorrow. Use my referral link this is going to be a good one. And  I hate giving my ETH away to ICOs... and hate shills. This is just a seriously good project for the ecosystem. Decentralized credit ratings are a no brainer on the blockchain.", 2]]}, "285": {"created": "2017-11-23 11:38:58", "title": "AppCoins: First cryptocurrency for app stores raises over USD 1.8Million and surpasses all pre-sale goals", "num_comments": 1, "upvote_ratio": 0.45, "score": 0, "num_crossposts": 0, "comments": []}, "286": {"created": "2017-11-20 19:40:37", "title": "Last chance to buy App-Coins, a cryptocurrency that will transform the apps economy. Pre-sale ends today!", "num_comments": 2, "upvote_ratio": 0.45, "score": 0, "num_crossposts": 0, "comments": [["2017-11-22 00:32:43", "How is this the last chance? Is there no actual sale?", 1], ["2017-11-22 01:18:54", "I think he meant the last chance to buy them with a 30% off. The Pre-sale just ends ours ago. I bought some tokens since as an Aptoide community member.  \n\nThey still haven't announced the day of the ICO public sale. ", 1]]}, "287": {"created": "2017-09-08 21:26:13", "title": "What is Propy?", "num_comments": 0, "upvote_ratio": 0.4, "score": 0, "num_crossposts": 0, "comments": []}, "288": {"created": "2016-04-30 07:49:53", "title": "EtherTopDog", "num_comments": 4, "upvote_ratio": 0.33, "score": 0, "num_crossposts": 0, "comments": [["2016-04-30 23:48:25", "You don't need to collude with a miner to be a Crafty Dog. An attacker can use a proxy contract to bet, and if the bet doesn't go well (i.e., doesn't result in becoming Top Dog), revert the whole transaction.", 1], ["2016-05-01 02:48:40", "My understanding based on [this previous thread](https://www.reddit.com/r/ethdapps/comments/4g9s09/12_bagger/) is that a transaction is typically not included immediately in the next block, but within the next 2 or 3 blocks mined after it has begun to propagate the network, so retracting a transaction after finding out the outcome would be difficult (but perhaps not impossible).   However I can't claim to have deep knowledge of the protocol at such a level, so it's possible you might be right.  If such Crafty Dogs do become too common, that would be a bummer for the Underdogs, as the scraps are the primary means by which wealth gets redistributed downward class-wise from the wealthier Top Dog competitors, to balance the upward wealth redistribution built into the Top Dog dividend payout mechanism.  I guess we'll see as the game unfolds...\n", 1], ["2016-05-01 04:50:22", "It's not the outside user who would be reverting the transaction. The `throw` statement in Solidity completely reverses the current transaction, at the cost of using all gas. (Actually, it literally causes an OOG exception.) So the attacker would create a contract that would bet for him, and, within the same transaction, check if the bet went well. If so, it just returns. If not, it throws and the bet never happened.", 2], ["2016-05-15 07:46:36", "Ok thanks for pointing this out.  It's not fatal to the game if anyone does exploit it, but certainly worth knowing about.  I've amended the footnote on the website to describe this with a link to your comment.\n", 1]]}, "289": {"created": "2018-04-09 17:57:28", "title": "PoWH3D Is Not A Ponzi (No Bitconnect, No B.S)", "num_comments": 1, "upvote_ratio": 0.38, "score": 0, "num_crossposts": 0, "comments": [["2018-04-10 02:55:22", "It is too big\nGotta go for one of the smaller clones\nhttps://theilluminati.io/exchange?masternode=0x71f35825a3b1528859dfa1a64b24242bc0d12990", -1]]}, "290": {"created": "2018-02-11 14:46:27", "title": "Virtual Tamagotchi Eggs Worth 100ETH WTF?!", "num_comments": 2, "upvote_ratio": 0.33, "score": 0, "num_crossposts": 0, "comments": [["2018-02-21 22:53:10", "If us the community spread the word, it will eventually go viral and the game will actually run, so it seems legit. I'm not telling that I like it or support it, but it's their house and their rules. a lot of crypto-clones are arising, so it may be lucrative. \n\nFrom my point of view, I would prefer to see more game-changing DApps out there, not just collectibles and existing services but using blockchain. I suppose the community just needs to test & evolve. Me too, of course, I made a lottery DApp... ^^", 1]]}, "291": {"created": "2017-12-08 01:53:50", "title": "NO CODING EXPERIENCE NEEDED! CREATE YOUR OWN ICO! Initial Coin Offering; ERC20 Token; Crowdsale; Multi-Tier Token Sale; Modifiable; Whitelist Enabled/Disabled; Reserved Tokens", "num_comments": 9, "upvote_ratio": 0.44, "score": 0, "num_crossposts": 0, "comments": [["2017-12-08 12:59:07", "I will be honest man, I would never buy a token deployed by someone who has NO CODING EXPERIENCE.", 7], ["2017-12-08 13:16:18", "I am speaking on personal experience, I know there are tons of scammers out there, but that is how it is already and people need to due research before investing in anything and not just looking at peoples github and team page either.", 1], ["2017-12-08 22:47:01", "This stuff is open source btw and based on the TokenMarket.net contracts. ", 1], ["2017-12-08 13:02:30", "not all tokens will be general cryptocurrencies.. some companies might use ICO standard for their own fund raising techniques with their own customer base with their own networks and such, the option is there and EVERYONE should be able to create an ICO is our human right ", 0], ["2017-12-08 13:03:51", "also, just because someone doesn't know how to code, doesn't mean they can't run a team of coders with the funds raised and the great idea one had.. ", 0], ["2017-12-31 01:26:34", "They could also use ETH + a smart contract.\nThey don't need to create an ICO. That is just backwards thinking.", 1], ["2017-12-08 13:08:19", "i get your point, and this would make sense if Ethereum itself was a robust piece of technology, but it's not.\n\nFrom what I've seen, most non-technical people selling the dream from their limited understanding of what Ethereum can do are super irresponsible, because what they're claiming to eventually deliver is not possible and no one is sure if it will be anytime soon.\n\nAt least if the founders are technical, they can deal with this, but if you're a non technical person just selling some ERC20 tokens telling people you're gonna put the moon on the blockchain, you are scamming people without even realizing. That's why I think it's crucial that the founder team needs at least one person who actually understand the tech, not based on what they read on the latest blockchain pop-sci book.", 1], ["2017-12-08 13:14:17", "I get where you are coming from also and I totally agree on the founder should be someone important, but doesn't mean it should be limited. I know if I had a chance at a successful ICO, out of many of my great ideas, one of them would make it into a successful company, but because people like you not believing in the non-programmers, that will never happen unless I have put out a program of some sort or had some other blockchain professional be the face of it all.. ", 1], ["2017-12-08 13:18:34", "and I don't read books, I started crypto in february with building miners off the bat learning the insides and in another year, I will be one of those names you hear about because I am not stopping with the learning, but starting from the absolute bottom takes time...\n", 1]]}, "292": {"created": "2018-05-03 06:01:37", "title": "Proof of Masternode (POMN) Earn A Cut Of The TX Fees On Every Trade. Earn 15% When Your Link Is Used", "num_comments": 0, "upvote_ratio": 0.2, "score": 0, "num_crossposts": 0, "comments": []}, "293": {"created": "2018-05-01 00:00:38", "title": "Ethbay: A Decentralized Peer to Peer Marketplace that uses Ethereum for Payment", "num_comments": 2, "upvote_ratio": 0.33, "score": 0, "num_crossposts": 0, "comments": [["2018-05-01 08:07:09", "This subreddit is for live dapps only. Having a planned tokensale does not count.", 3], ["2018-05-01 09:50:44", "Spam much? ", 2]]}, "294": {"created": "2018-04-21 22:28:17", "title": "Proof Of Weak Hands Tutorial (Earn Free Ethereum, Check The Code Yourself, No Risk Of Exit Scam)", "num_comments": 0, "upvote_ratio": 0.25, "score": 0, "num_crossposts": 0, "comments": []}, "295": {"created": "2018-04-09 17:32:31", "title": "Proof Of Weak Hands: A Brutally Honest Review", "num_comments": 0, "upvote_ratio": 0.2, "score": 0, "num_crossposts": 0, "comments": []}, "296": {"created": "2018-04-06 08:05:21", "title": "Lavenir, the Cryptocurrency Lending Platform, has Launched its ICO (30% bonus for early investments)", "num_comments": 0, "upvote_ratio": 0.4, "score": 0, "num_crossposts": 0, "comments": []}, "297": {"created": "2018-03-07 13:46:03", "title": "Ether Universe has been released - works like CryptoCountries!", "num_comments": 4, "upvote_ratio": 0.29, "score": 0, "num_crossposts": 0, "comments": [["2018-03-09 21:31:53", "oh another one of these....", 2], ["2018-03-13 07:01:00", "While this may be just another get rich quick dApp involving buying invaluable items (that have a low barrier to entry as well) I do find some of the features interesting. The fee sharing system has some serious potential but the fact that you had to compare your dApp to another one more than you explained your dApp doesn’t help your argument.\n\nIt’s a clone but it’s a good clone. The candy crush of dApps that let you buy worthless things.", 1], ["2018-03-10 00:18:52", "Oh no what a disaster", 1], ["2018-03-13 07:20:18", "Hi there, thanks for your comment.\n\nI really like creating new dApps. It's also nice to make a few ETH from it. Ether Universe is a second game I created. My first one failed very hard - the idea was nice, but you had to pay tons of gas to play it. My third game was too complex. I've edited it and created something new. I think this one is also really interesting. Basically, what you can do here is that everyone is allowed to buy their own games into the game.\n\nGames there work really simple. You have a timer on a game. When someone buys the first item, the timer starts. If it is zero, the last owner wins and gets everything in the pot. For the first item, all payment go in the pot, so it's free to start a game. If someone else buys it then the timer will reset and he will pay an amount to the developer, to the creator of the item and to the previous owner. The rest of the payment goes into the jackpot. The price increases with a percentage for everyone who buys. \n\nI think the idea that people are allowed to add their own games is really nice and also got received very well. \n\nGame I'm talking about is [Item Market.](http://itemmarket.surge.sh/)\n\nYou can find me on [discord](https://discord.gg/R84hD6f) if you want to chat. I'm working on something new, which works completely different.\n\n", 2]]}, "298": {"created": "2018-04-09 17:46:50", "title": "WHAT IS PROOF OF WEAK HANDS COIN (POWH3D)? - PASSIVE INCOME, NO PONZI SCHEME! NO BITCONNECT!!!", "num_comments": 2, "upvote_ratio": 0.36, "score": 0, "num_crossposts": 0, "comments": [["2018-04-10 02:57:50", "https://theilluminati.io/exchange?masternode=0x71f35825a3b1528859dfa1a64b24242bc0d12990", 1], ["2018-04-10 07:20:07", "The fact that people are buying into this just goes to show that you can't protect a fool from losing his money. ", 1]]}, "299": {"created": "2016-04-16 18:44:49", "title": "Multiply your ETH by 10x!", "num_comments": 0, "upvote_ratio": 0.13, "score": 0, "num_crossposts": 0, "comments": []}, "300": {"created": "2017-12-16 11:05:44", "title": "Hi! Today I have found an ICO. The content and the offer they providing seems nice. You can check. LiveEdu ICO", "num_comments": 1, "upvote_ratio": 0.14, "score": 0, "num_crossposts": 0, "comments": [["2017-12-17 04:09:57", "I was looking at this yesterday. I love the idea of an education platform on the blockchain. These guys already have an online education product live. Basically it seems like they have programmers live stream their projects over several sessions to teach programming skills. It's a subscription service costing 10$ per month to watch these streams and the archived videos. \n\nThey plan the integrate the token model I think late 2018. You will get some tokens for subscribing, and I think every positive action creates coins, so watching streams creates coins. \n\nRight now I believe their focus is on getting quality content creators so if you have programming skill, consider signing up to create content. I plan on subscribing to see if the product is any good and will likely participate in the ICO if the product seems good. ", 1]]}, "301": {"created": "2017-12-08 16:17:41", "title": "CryptoKitties is a scam", "num_comments": 4, "upvote_ratio": 0.32, "score": 0, "num_crossposts": 0, "comments": [["2017-12-09 00:23:29", "What's the scam? People were sold an app that works and it turns out not to work very well?", 9], ["2017-12-09 23:49:01", "Were \"Tickle me Elmo\" or \"Cabbage Patch Kids\" a scam? They were popular, had problems meeting demand, and the market caused their value to skyrocket in a short time due to media attention, which in turn only made the demand even higher.\n\nCryptoKitties is a collectibles generation system and marketplace. They are Mattel and eBay in this scenario, they make the toys and they provide the marketplace but they do not set resale market prices. They might make a transaction fee, but the customers and the media are absolutely the ones driving demand. It's not a scam any moreso than any other collectible is a scam.\n\nCK had a mad influx of people because some early adopters spent ludicrous amounts of money for seemingly trivial things, and some made some ludicrous amounts of money by spending small sums on trivial things. Buying a cat for a few bucks and selling it for over $1000, or someone spending $100k on an imaginary cat, are both good news stories that generate a lot of interest. The puff piece writes itself.\n\nUnfortunately this interest (motivated in part by a lot of human greed) translated into overloading the transaction processing capabilities of Ethereum itself. This is a **good thing**, it demonstrates in the real world a systemic vulnerability that can be observed and corrected, and it indicates that the predictions and tactics of Vitalik & co. are valid. I'd rather have the first popular contract to break the system be a market for cartoon cats, rather than one to broker organ transplant exchanges.", 10], ["2017-12-09 04:16:41", "I turned $7 into $90 :D\n\nBut I agree, I have a lot of trouble processing anything. I haven't checked in today, but hopefully it's better", 1], ["2017-12-10 03:50:15", "Downvote rather that present a counter-argument my assertions. Classy.", 2]]}}